label common_end:
    scene black with dissolve
    stop music
    play music 憂鬱

    th "ความทรงจำในอดีตหวนกลับมาอีกครั้ง"
    th "...เราจำได้แล้ว...ว่าทำไมพวกเราทั้งสองจึงมาอยู่ที่คฤหาสน์แห่งนี้..."
    th "ที่นี่ไม่ใช่โลกความเป็นจริง มันคือโลกหลังความตาย"
    th "....."

    scene black with dissolve

    th "หลังจากเราฆ่าคน แม้เราไม่มีเจตนา แต่เราไม่สามารถหลบหนีการลงโทษได้"
    th "เราถูกตัดสินจำคุกข้อหาฆ่าพ่อของแมรี่"
    th "ก่อนที่เราสองคนจะจากกัน พวกเราสองคนได้ให้สัญญากัน"
    th "...เมื่อเราออกจากเรือนจำและเป็นอิสระ พวกเราสองคนจะกลับมาอยู่ด้วยกันอีกครั้งหนึ่ง"
    th "....."

    scene sky_cloudy with dissolve
    th "เวลาผ่านไปหลายปี เราพ้นโทษและออกมาจากเรือนจำ"
    th "แต่เมื่อเรากลับมาหาแมรี่ ทุกอย่างก็สายไปแล้ว"
    th "....."

    scene hospital with dissolve
    th "เราพบร่างไร้สติของแมรี่บนเตียงในโรงพยาบาล"
    th "ไม่ว่าเราจะเรียกเธอสักกี่ครั้ง แมรี่ก็ไม่ลืมตาตื่นขึ้น"

    yume_th "ว่าไงนะคะ?"

    th "เราไม่อยากเชื่อหูของเราเมื่อได้ยินความจริงจากแพทย์ที่ดูแลแมรี่"
    th "แมรี่ร่างกายอ่อนแอตั้งแต่เด็กๆแล้ว แต่เธอปิดความลับนี้ไว้และแสร้งทำเป็นแข็งแรงดีต่อหน้าเรา"
    th "อวัยวะภายในของเธอล้มเหลวมากขึ้นตามเวลาที่ผ่านไป"
    th "...จนสุดท้ายแมรี่ก็กลายเป็นเจ้าหญิงนิทรา..."
    th "เธอจะมีชีวิตได้อีกไม่กี่วันเท่านั้น"
    th "....."

    scene black with dissolve

    th "ความสิ้นหวังทำให้เราหัวเราะและร้องไห้ออกมาพร้อมๆกัน"
    th "...เอาอีกแล้ว..."
    th "ทั้งเรื่องที่ถูกคนรอบข้างรังแกและตีตัวออกห่างเพราะแม่เป็นฆาตกร"
    th "ทั้งพ่อที่นิสัยเลวร้ายลงหลังจากบ้านเราแตกสาแหรกขาด"
    th "ทั้งเรื่องที่เราฆ่าพ่อของแมรี่โดยไม่ได้ตั้งใจจนถูกจับเข้าเรือนจำ"
    th "ทุกสิ่งไม่เป็นตามที่เราต้องการ...แต่เราก็ยังอดทนได้..."
    th "....."
    th "แต่ว่า...แมรี่..."
    th "ผู้หญิงที่เรารักที่สุด...ความสุขในชีวิตเราที่ยังหลงเหลืออยู่..."
    th "...พังทลาย..."
    th "...ชีวิตของเธอกำลังพังทลายลง..."
    th "...ต่อหน้าเรา..."
    th "...โดยที่เรา..."
    th "...เรา..."
    th "....."
    th "...เราไม่สามารถทำอะไรได้แม้แต่อย่างเดียว..."
    th "....."
    th "ยูเมะ" 
    th "เธอจะมีตัวตนอยู่บนโลกนี้ทำไมกัน?"
    th "ในเมื่อเธอไม่สามารถรักษาสิ่งสำคัญของตัวเองเอาไว้ได้"
    th "...แม้แต่อย่างเดียว..."
    ###############################
    scene road with dissolve

    th "ความหม่นหมองในใจทำให้เราสติเหม่อลอย"
    th "ทั้งที่ยังมีลมหายใจแต่เรารู้สึกเหมือนวิญญาณแหลกสลายไปแล้ว"
    th "...ภาพตรงหน้ามืดมัวไปหมด..."
    th "ความหวังคืออะไรกัน?"
    th "...โลกนี้...มันคงไม่มีความหวังสินะ..."
    th "....."
    th "นี่เรากำลังย่างเท้าลงบนถนนงั้นเหรอ?"
    th "เราไม่รู้ด้วยซ้ำว่าเรากำลังทำอะไรอยู่และทำไปทำไม"
    th "....."
    th "ไม่ช้าหลังจากนั้น เสียงบีบแตรของรถก็ดังขึ้น"
    scene black with Dissolve(0.2)
    th "รถคันหนึ่งประชิดร่างของเราพร้อมกับที่แรงกระแทกมหาศาลถูกส่งผ่านเข้ามาในร่างกาย"
    th "ภาพตรงหน้าเรามืดลงในพริบตาเดียว"
    th "....."
    th "ทำไมเราถึงนอนอยู่บนถนนกันนะ?"
    th "ทำไมร่างของเราถึงเปียกชื้นด้วยของเหลวกลิ่นเหมือนเหล็ก?"
    th "ทำไมถึงรู้สึกหนาวเหน็บไปหมดกัน?"
    th "ทำไม?"
    th "มืดมิด..."
    th "...โลกนี้ช่างมืดมิดจริงๆ..."
    th "....."
    th "...ช่างมันเถอะ..."
    th "ไม่ว่าจะเกิดอะไรขึ้นก็ไม่สำคัญอีกแล้ว"

    scene fb3_3 with dissolve

    th "เราหลั่งน้ำตาออกมาอย่างหยุดไม่ได้"
    th "ความรู้สึกอันรุนแรงขับเคลื่อนให้เราเดินเข้าใกล้แมรี่ทีละก้าวๆ"
    th "จนสุดท้ายมือของเราก็สัมผัสกับมือของเธอ"
    th "...มือของเธอเย็นเฉียบ..."
    th "ราวกับไม่มีชีวิตหลงเหลือในร่างของเธอเลยแม้แต่นิดเดียว"

    yume_th "ที่นี่คือโลกหลังความตายสินะ"
    voice "audio/voice/common_end/mary_11_000.mp3"
    mary_th "...."
    yume_th "ไม่เป็นไรหรอก อย่างน้อยๆฉันก็ได้กลับมาเจอกับเธอ แมรี่"
    th "แมรี่ทำท่าเหมือนจะพูดอะไรสักอย่างแต่เธอกลืนคำพูดลงไป"
    th "เด็กสาวผมทองแสดงสีหน้าเจ็บปวดรวดร้าวออกมา"
    voice "audio/voice/common_end/mary_11_001.mp3"
    mary_th "ถ้านั่นเป็นสิ่งที่เธออยากเข้าใจ ฉันก็จะไม่หยุดเธอ"
    yume_th "....."


    voice "audio/voice/common_end/mary_11_002.mp3"
    mary_th "ถึงแม้ว่าฉันจะไม่ได้ต้องการให้ผลลัพธ์ออกมาแบบนี้ก็ตาม แต่ว่า..."
    th "แมรี่หัวเราะเศร้าๆให้เรา"
    th "เธอเม้มปากแน่นก่อนที่จะค่อยๆเปล่งเสียงให้เราได้ยิน"
    th "ขณะเดียวกัน โลกรอบข้างพวกเราทั้งสองก็ค่อยๆมืดลง"
    voice "audio/voice/common_end/mary_11_003.mp3"
    mary_th "เธอจะไปกับฉันจริงๆเหรอ?"
    yume_th "....."
    voice "audio/voice/common_end/mary_11_004.mp3"
    mary_th "ถ้าเธอเลือกที่จะจับมือฉัน เธอจะไม่มีวันได้กลับไปมีชีวิตอีกเลยนะ"
    th "ดวงตาของแมรี่จับจ้องเข้าในดวงตาของเราตรงๆ"
    th "เราพยักหน้าให้เธอทั้งน้ำตา เพราะนั่นคือสิ่งที่เราต้องการจากใจจริง"
    yume_th "ถ้าพวกเราอยู่ พวกเราจะอยู่ด้วยกัน ถ้าพวกเราจะตาย ฉันก็ขอตายด้วยกันกับเธอ"
    voice "audio/voice/common_end/mary_11_005.mp3"
    mary_th "ยูเมะ..."
    yume_th "ฉันรักษาสัญญาแล้วนะ"
    th "เราส่งยิ้มให้กับผู้หญิงที่เรารัก"
    th "ไม่ว่าจะเกิดอะไรขึ้น เราจะไม่มีวันปล่อยมือคู่นี้ไป"
    th "สัมผัสที่เราสองเชื่อมต่อกันจะไม่มีวันเสื่อมคลายลง...เป็นอันขาด..."
    yume_th "ฉันกลับมาแล้ว...แมรี่..."
    th "โลกรอบข้างเริ่มจมลงสู่สีดำ"
    th "ภาพตรงหน้ากำลังถูกย้อมด้วยความมืด"
    th "สิ่งสุดท้ายที่เราเห็นคือรอยยิ้มเศร้าๆของเด็กสาวผมทอง"
    th "....."

    scene black with Dissolve(3)
    th "ท้ายที่สุดแล้ว ความมืดก็กลืนกินพวกเราทั้งสองคน"
    th "...จนหมดสิ้น..."
    
    "Common End: Together Forever"
    th "..."
    th ".."
    th "."
    th "จบแบบนี้น่ะ มันถูกต้องแล้วเหรอ?"
    scene black with Dissolve(3)

    return











