label final:
    scene cg2_1 with Dissolve(3)
    stop music
    play music reflect

    yume_th "นี่มัน..."

    th "เราไม่อยากเชื่อสายตาของตัวเอง"
    th "ใบหน้าของคนคนหนึ่งจ้องมองกลับมาที่เรา"
    th "หญิงสาวเรือนผมสีดำถลึงมองเราด้วยดวงตาคู่โตของเธอ"
    th "ความคุ้นเคยนี่มัน..."
    th "ไม่สิ"
    th "นี่ไม่ใช่แค่ความคุ้นเคย"
    th "มันไม่ใช่แค่นั้น"
    th "....."
    th "มันคือ ความจริง"
    th "มนุษย์ไม่สามารถหลีกหนีจากความจริงได้ตลอดไป"
    th "....."
    th "สิ่งที่ปรากฏตรงหน้าเราคือกระจกบานใหญ่"
    th "ภาพที่เราเห็นตอนนี้คือ...ใบหน้าที่แท้จริงของเรา..."

    yume_th "...ผู้หญิง?"
    scene cg2_2 with dissolve

    th "เรามั่นใจว่าคนในความทรงจำที่เราคุยด้วยคือผู้หญิง"
    th "...แต่ตัวเรา...?"
    th "เราก็เป็นผู้หญิงด้วยเหรอ"
    th "ความรู้สึกผูกพันและโหยหาที่เรามีต่อเธอคนนั้น"
    th "...รอยจูบที่เธอคนนั้นฝากไว้ให้..."
    th "นั่นหมายความว่า..."

    yume_th "...อึก!!"

    th "ความรู้สึกเจ็บแทรกผ่านเข้ามาในศีรษะ"
    th "ความทรมานราวกับถูกมีดฉีกทึ้งข้างในกะโหลกเกิดขึ้นซ้ำแล้วซ้ำเล่า...ซ้ำแล้วซ้ำเล่า..."
    th "ภาพสะท้อนในกระจกคือหญิงสาวที่กำลังส่งเสียงกรีดร้อง"
    th "ใบหน้าของเธอคนนั้นบิดเบี้ยวไปด้วยความเจ็บปวด ก่อนที่เธอจะทรุดเข่าลง"

    scene black with Dissolve(1)

    th "ภาพตรงหน้าค่อยๆจมลงสู่สีดำ"
    th "ใบหน้าในกระจกนั้นไม่ใช่ใครอื่น นอกจากเงาสะท้อนของตัวเราเอง"

    scene black with dissolve
    stop music
    play music 憂鬱

    th "ภาพความทรงจำทุกอย่างกำลังตีกลับมา"
    th "สิ่งที่ทำให้มีความสุข สิ่งที่ทำให้จมอยู่ในความทุกข์ สิ่งที่ไม่อยากนึกถึงค่อยๆปรากฏขึ้น"
    th "ใช่แล้ว"
    th "...ชื่อของเราคือ ยูเมะ..."

    scene sky_cloudy with dissolve

    th "เท่าที่เราจำความได้ ชีวิตวัยเด็กของเราไม่ใช่เรื่องดีเท่าไหร่นัก"
    th "ครอบครัวของเรามีแต่ความขัดแย้งกัน ทุกวันๆเต็มไปด้วยการทะเลาะเบาะแว้งเรื่องหนี้สินและการแบ่งมรดกระหว่างตระกูลฝั่งพ่อและฝั่งแม่"
    th "เราไม่ค่อยรู้รายละเอียดของเรื่องเงินทองเพราะตอนนั้นเรายังเด็กมาก"
    th "สิ่งที่เราจำได้ไม่มีวันลืมคือ แม่ของเราเป็นฆาตกร"
    th "....."
    scene kitchen03 with dissolve
    th "แม่ทะเลาะกับญาติฝั่งพ่อที่เป็นผู้อาวุโสคนหนึ่งซึ่งเป็นที่นับหน้าถือตากันในหมู่บ้าน"
    th "ปัญหาที่ทะเลาะกันก็เป็นเรื่องมรดกเงินทองไม่ต่างจากเดิม แต่เพราะโทสะบังตาและถูกต้อนจนมุม แม่ของเราจึงระเบิดอารมณ์ใส่ญาติคนนั้น"
    th "เราในตอนเด็กไม่สามารถห้ามแม่เอาไว้ได้"
    th "เราที่ไร้พลังได้แต่ยืนมองแม่แท้ๆใช้มือบีบคอญาติคนนั้นจนตาย"

    th "....."

    th "หลังจากนั้นไม่นาน แม่ก็ถูกจับเข้าเรือนจำ"
    th "ข่าวการเป็นฆาตกรของแม่แพร่สะพัดไปอย่างรวดเร็ว"
    th "ญาติที่แม่เราฆ่าเป็นที่เป็นนับหน้าถือตาในชุมชน จึงไม่ใช่เรื่องแปลกที่จะข้อมูลจะจะถูกรู้อย่างทั่วถึงในเวลาไม่กี่วัน"

    th "แน่นอนว่ามันมีผลมาถึงชีวิตในโรงเรียนของเราด้วย"
    th "....."

    stop music
    play music 哀愁漂うホラー的な
    scene classroom_sunset with dissolve
    th "เราถูกคนในห้องเรียนมองว่าเป็นลูกของฆาตกร ทำให้เพื่อนๆตีตัวออกห่างจากเราทีละคนๆ"
    th "ชีวิตในโรงเรียนที่เคยสงบสุขพังทลายลงเพราะบาปที่เราไม่ได้ก่อ"
    th "ท้ายที่สุดเราก็ไม่เหลือใครอยู่เลยนอกจากคนที่คอยรังแกเรา"
    th "อย่างไรก็ตาม เราไม่ได้สนใจจะเป็นเพื่อนกับคนพวกนั้นอยู่แล้ว"
    th "คนที่ตัดสินคนอื่นจากบาปของคนในสายเลือดมีแต่พวกชั้นต่ำเท่านั้น"
    th "ถ้าต้องฝืนคบหากับคนพวกนั้น เอาเวลาไปสนิทกับแมวข้างบ้านยังจะมีประโยชน์ซะกว่า"

    yume_th "ไม่รู้จักเปลี่ยนมุกเลยนะ เจ้าพวกบ้านั่น"

    th "เราถอนใจพร้อมกับใช้ผ้าขาวชุบน้ำขัดโต๊ะเรียนหนังสือ"
    th "การถูกใครก็ไม่รู้เขียนข้อความด่าทอว่าเป็นลูกของฆาตกรเป็นเรื่องที่เราโดนไม่รู้กี่สิบครั้งแล้ว"
    th "ครั้งแรกๆที่โดนก็เสียใจอยู่หรอก แต่พอโดนบ่อยๆก็ชินชาจนเผลอเตรียมชุดทำความสะอาดมาโรงเรียนมาขัดโต๊ะบ่อยๆ"
    th "พรุ่งนี้จะเป็นอะไรอีกนะ? โดนเอาของไปซ่อนหรือว่าโดนโยนขยะใส่กัน?"

    yume_th "เฮ้อ..."

    th "คนพวกนี้คิดว่าการรังแกคนที่ตัวเองคิดว่าผิดทำให้ตัวเองเป็นฝ่ายที่ถูกต้องหรือไงกัน?"
    th "โง่เง่าชะมัดยาด"

    th "ไอ้ลูกฆาตกร"
    yume_th "เฮ้อ..."
    th "คำพูดของคนที่ด่าทอเราดังขึ้นในศีรษะ" 
    th "เสียงจากความทรงจำที่ไม่อยากนึกถึงทำให้เรารู้สึกเดือดดาลขึ้นมา"
    th "...พวกน่ารังเกียจ...ต่อให้ไม่ตอบโต้หรือทำเป็นไม่สนใจก็จะโดนรังแกอยู่ดี..."
    th "ความอดทนของเราไม่มีความหมายแม้แต่นิดเดียว"
    th "...หรือว่า...การใช้กำลังจะเป็นทางที่ดีกว่ากันนะ...?"

    yume_th "...ฮึ"

    th "เราแค่นเสียงในลำคอเบาๆ"
    th "...บางทีสิ่งที่แม่ทำอาจจะเป็นสิ่งที่ถูกต้อง..."
    th "ถ้าพวกมันไม่คิดจะฟังเรา พวกมันก็ไม่ควรมีโอกาสได้ฟังอีกต่อไป"
    th "...ถูกแล้ว..."
    th "...ปล่อยตัวเองไปตามสัญชาตญาณสิ..."

    yume_th "ชิ"

    th "เราทุบโต๊ะเบาๆด้วยความไม่สบอารมณ์"
    
    th "ความรู้สึกชั่ววูบเมื่อครู่ทำให้เราขยะแขยงตัวเองขึ้นมา"
    th "...ไม่...เราจะไม่ทำตัวอย่างผู้ใหญ่พวกนั้น"
    th "เราน่ะ..."
    th "เรา..."

    stop music
    play music 泣カナイデ

    ##voice "audio/voice/final/mary_10_000.mp3"
    mary0_th "ถ้าขัดตรงที่สะอาดหมดแล้วซ้ำๆ มันจะไม่เสร็จสักทีนะ"
    yume_th  "หืม?"
    th "ขณะที่ความคิดของเราดำดิ่งสู่ความมืด เสียงกังวานใสเสียงหนึ่งก็ดังขึ้น"
    th "เวลานี้เป็นเวลาหลังเลิกเรียน นักเรียนคนอื่นน่าจะกลับบ้านกันหมดแล้ว แต่เด็กสาวผมทองในชุดนักเรียนชั้นปีเดียวกับเรากลับยืนมองเราด้วยสายตาสนอกสนใจ"
    yume_th  "เธอเป็นใคร?"
    th "ดวงตาคู่โตของเด็กสาวผมทองเบิกกว้างขึ้นน้อยๆ"
    th "เธอดูประหลาดใจกับคำถามของเรา"
    ##voice "audio/voice/final/mary_10_001.mp3"
    mary0_th "แมรี่ไงจ้ะ"
    yume_th "แมรี่?"
    ##voice "audio/voice/final/mary_10_002.mp3"
    mary_th "โธ่ ฉันเป็นนักเรียนแลกเปลี่ยนที่เข้ามาใหม่วันนี้ไงล่ะ"
    th "เด็กสาวผมทองที่ชื่อแมรี่ทำแก้มป่องน้อยๆ"
    th "ทั้งๆที่เป็นคนแปลกหน้ากัน แต่ทำไมคนๆนี้ถึงเข้ามาใกล้เราขนาดนี้กันนะ"
    th "พิลึกคนจริงๆ"
    yume_th  "เธอจะเอาผ้ามาทำไม?"
    ##voice "audio/voice/final/mary_10_003.mp3"
    mary_th "มาช่วยเธอขัดโต๊ะไงจ้ะ"
    th "เราทำตาปริบๆใส่แมรี่ด้วยความไม่เข้าใจ"
    th "คนๆนี้จะได้อะไรจากการช่วยเรากัน"
    yume_th "ขอบคุณสำหรับความหวังดี" 
    ##voice "audio/voice/final/mary_10_004.mp3"
    mary_th "จ้ะ"
    yume_th "แต่ถ้ามาช่วยฉัน เธอจะโดนคนอื่นรังแกไปด้วยนะ"
    ##voice "audio/voice/final/mary_10_005.mp3"
    mary_th "....."
    th "เราพูดความจริงต่อหน้าเด็กสาวผมทอง"
    th "ทั้งๆที่เราพูดเพื่อจะกันเธอออกไป แต่แมรี่กลับยื่นผ้ามาเช็ดโต๊ะให้เราพร้อมกับยิ้มบางๆออกมา"
    yume_th "ทำไม?"
    ##voice "audio/voice/final/mary_10_006.mp3"
    mary_th "หา?"
    yume_th "ทำไมถึงช่วยฉันล่ะ?"
    ##voice "audio/voice/final/mary_10_007.mp3"
    mary_th "เธอรู้ไหมว่าเธอเป็นคนอ่อนโยนกว่าเธอคิดนะ"
    "แมรี่ตอบไม่ตรงคำถาม ทำให้เราเลิกคิ้วขึ้นด้วยความประหลาดใจ"
    ##voice "audio/voice/final/mary_10_008.mp3"
    mary_th "เธอจะไล่ตะเพิดหรือมองข้ามฉันก็ได้ แต่เธอเลือกที่จะเตือนฉันดีๆเพราะเป็นห่วงฉัน"
    yume_th "....."
    ##voice "audio/voice/final/mary_10_009.mp3"
    mary_th "ขนาดเราไม่ค่อยรู้จักกัน เธอยังคิดถึงฉันขนาดนี้ ถ้าไม่ใช่คนอ่อนโยนแล้วจะเรียกว่าอะไรดีล่ะจ้ะ?"
    th "เด็กสาวผมทองส่งยิ้มกว้างกว่าเดิมให้เรา คำตอบของเธอทำให้เรารู้สึกสับสนอย่างบอกไม่ถูก"
    yume_th "พิลึกคนชะมัด"
    ##voice "audio/voice/final/mary_10_010.mp3"
    mary_th "คนอื่นก็ชอบบอกแบบนั้นล่ะจ้ะ"
    yume_th "ฮึๆๆ"
    th "เราส่งเสียงหัวเราะในลำคอเบาๆ"
    th "ตั้งแต่เมื่อไหร่กันนะที่เราไม่ได้หัวเราะให้คนอื่นเห็น น่าจะหลายปีพอสมควรเลย"
    ##voice "audio/voice/final/mary_10_011.mp3"
    mary_th "เธอชื่ออะไรเหรอจ้ะ?"
    yume_th "จะอยากรู้ชื่อตัวปัญหาประจำชั้นเรียนทำไมกัน?"
    ##voice "audio/voice/final/mary_10_012.mp3"
    mary_th "อยากรู้น่ะ ไม่ต้องมีเหตุผลหรอกจ้ะ"
    th "แมรี่หัวเราะให้เราบ้าง" 
    th "ช่างเป็นผู้หญิงที่แปลกประหลาดจริงๆ"
    yume_th "ฉันชื่อยูเมะ"
    ##voice "audio/voice/final/mary_10_013.mp3"
    mary_th "ชื่อน่ารักดีนะ ไม่เข้ากับหน้าตาเลยจ้ะ"
    yume_th "เดี๋ยว?"
    ##voice "audio/voice/final/mary_10_014.mp3"
    mary_th "ล้อเล่นจ้ะๆ...ฝากตัวด้วยนะ ยูเมะ..."
    yume_th "อืม"
    th "เราพยักหน้าให้เด็กสาวผมทองเบาๆ"

    scene sky_cloudy with dissolve
    stop music
    play music up_to_you

    th "ตั้งแต่นั้นเป็นต้นมา แมรี่ก็เข้ามาตีสนิทกับเรา"
    th "ตอนแรกก็รำคาญอยู่บ้าง แต่ไปๆมาๆ เราก็ชินกับการที่แมรี่ชวนคุยเรื่องไม่เป็นเรื่อง"
    th "แมรี่ชอบเข้ามาหาเราและแกล้งให้เราตกใจ ต่อจากนั้นก็จะหาปริศนาแปลกๆมาให้เราไขอยู่เรื่อย"

    ##voice "audio/voice/final/mary_10_015.mp3"
    mary_th  "ไขให้ได้สิจ้ะ ฮะๆๆ"
    yume_th  "ฉันอ่านอักษรรูนไม่รู้เรื่อง ฉันจะไขยังไง?"
    ##voice "audio/voice/final/mary_10_016.mp3"
    mary_th  "ใช้ความพยายามจ้ะ เดี๋ยวมันก็ได้เอง"
    yume_th  "ฉันไม่อยากใช้ความพยายามกับของแบบนี้สักนิด เฮ้อ"
    ##voice "audio/voice/final/mary_10_017.mp3"
    mary_th  "โอวว คนใจร้าย"
    th "ปริศนาของแมรี่มีมากมายไม่รู้จบ"
    th "มีทั้งที่ง่ายจนน่าตลก ยากจนชวนปวดหัวและกวนประสาทจนฟังเฉลยแล้วเรารับไม่ได้"

    scene classroom_morning with dissolve
    th "เวลาผ่านไปหลายเดือน" 
    th "พวกเราสองคนสนิทกันถึงขนาดไปไหนมาไหนด้วยกันตลอดเวลา" 
    th "ถึงส่วนมากจะเป็นแมรี่เดินไล่ตามเรามากกว่าก็เถอะนะ"

    ##voice "audio/voice/final/mary_10_018.mp3"
    mary_th "วันนี้มีปริศนามาให้ทายจ้ะ"
    yume_th "ไม่เอาได้ไหม?"
    ##voice "audio/voice/final/mary_10_019.mp3"
    mary_th "ใจร้าย!"
    yume_th "คราวก่อนก็ password is easier than you think มุกขายขำแบบนั้นไม่เอาอีกแล้วนะ"
    ##voice "audio/voice/final/mary_10_020.mp3"
    mary_th "เธอไม่คิดว่ามันตลกดีเหรอจ้ะ?"
    yume_th "คนทายน่ะตลก แต่คนตอบน่ะปวดหัว"
    ##voice "audio/voice/final/mary_10_021.mp3"
    mary_th "ใจความสำคัญอยู่ที่ฉันขำจ้ะ"
    yume_th "แล้วฉันล่ะ?"
    ##voice "audio/voice/final/mary_10_022.mp3"
    mary_th "การถามปริศนาเล่นมุก ต้องมีฝ่ายใดฝ่ายหนึ่งเสียสละอยู่แล้วจ้ะ"
    yume_th "ฉันไม่รู้จะว่าอะไรกับเธอเลย"
    th "วันคืนอันไร้แก่นสารหมดไปกับการคุยเรื่องไร้สาระและทายปัญหาชวนหัว"
    th "ถึงจะไร้แก่นสารแต่มันก็ไม่ได้แย่"
    th "เพราะการใช้เวลาร่วมกันกับแมรี่ทำให้เราดีใจอย่างบอกไม่ถูก"
    scene nightsky
    stop music
    play music 手紙のさよなら

    th "เราเคยถามแมรี่ว่าเธอมีโอกาสหาเพื่อนคนอื่นตั้งมากมาย ทำไมเธอถึงมาสนิทกับเราคนเดียว"
    th "ช่วงแรกเธอไม่ยอมตอบคำถามนี้ให้เรา ทุกครั้งที่เราถามเธอ แมรี่จะแสดงสีหน้าลำบากใจ ไม่ก็พยายามเปลี่ยนเรื่องเป็นการทายปริศนาที่เธอชอบแทน"
    th "หลังจากอยู่ด้วยกันหลายเดือน เพื่อนสนิทคนแรกของเราก็พูดความจริง"
    th "พวกเราสองคนมีปูมหลังที่คล้ายกัน"
    th "แมรี่เห็นเราถูกทิ้งเลยเข้าใกล้เรา"
    th "ทั้งหมดเพราะเธอไม่อยากให้เราอยู่คนเดียว"

    ##voice "audio/voice/final/mary_10_023.mp3"
    mary_th "ครอบครัวของฉันค่อนข้างมีปัญหาน่ะ"
    yume_th "....."
    ##voice "audio/voice/final/mary_10_024.mp3"
    mary_th "ปัญหาอาจจะไม่ได้ใหญ่เท่าเธอ แต่มันก็ทำให้ฉันมองหน้าคนในบ้านไม่ติดอยู่ดีจ้ะ"
    th "นั่นเป็นไม่กี่ครั้งที่เราเห็นแมรี่ทำหน้าเศร้า"
    th "เด็กสาวผมทองที่เจิดจ้าราวกับดวงอาทิตย์หุบยิ้มลง ทำให้โลกดูมืดหม่นลงทันใด"
    ##voice "audio/voice/final/mary_10_025.mp3"
    mary_th "พ่อกับแม่ของฉันไม่ได้รักกันจริงๆ พวกเขาแต่งงานกันเพราะเรื่องทางธุรกิจ"
    yume_th "แนวๆตระกูลร่ำรวยสองตระกูลดองญาติกันเพื่อผลประโยชน์เหรอ?"
    th "แมรี่พยักหน้าด้วยสีหน้าขึงขัง"
    th "หาได้ยากจริงๆที่คนร่าเริงอย่างเธอจะแสดงด้านนี้ออกมา"
    ##voice "audio/voice/final/mary_10_026.mp3"
    mary_th "พ่อและแม่ของฉันทะเลาะกันบ่อยๆ"
    yume_th "....."    
    ##voice "audio/voice/final/mary_10_027.mp3"
    mary_th "ครอบครัวของฉันเห็นฉันเป็นลิ่มที่ตรึงทั้งสองครอบครัวเข้าด้วยกัน คุณค่าของฉันมีแค่นั้นแหละ เพราะแบบนั้น...บางครั้งพวกเขาก็มาทำร้ายฉันเพราะฉันเป็นลูกที่พ่อแม่ไม่ต้องการ..."
    yume_th "....."
    ##voice "audio/voice/final/mary_10_028.mp3"
    mary_th "อย่าทำหน้าเครียดสิ...ถึงตอนเด็กๆจะโดนเล่นงานบ่อยๆ แต่พอโตขึ้นก็ไม่ค่อยโดนแล้วล่ะ...ฮะๆ"
    yume_th "....."
    ##voice "audio/voice/final/mary_10_029.mp3"
    mary_th "เรื่องมันไม่น่าฟังเลยนะ ว่าไหม?"
    th "แมรี่ส่งยิ้มเศร้าๆให้กับเรา แม้กระทั่งเสียงหัวเราะของเธอยังดูเป็นการฝืนเลย"
    yume_th "พวกผู้ใหญ่นี่เฮงซวยจังเนอะ"
    ##voice "audio/voice/final/mary_10_030.mp3"
    mary_th "ก็ถูกจ้ะ แต่คงไม่ใช่ทุกคนหรอก"
    yume_th "เธอนี่มองโลกในแง่ดีจังนะ"
    ##voice "audio/voice/final/mary_10_031.mp3"
    mary_th "ยูเมะต่างหากที่มองโลกในแง่ร้ายเกินไปจ้ะ"

    th "แมรี่ส่ายหน้าเบาๆก่อนจะส่งยิ้มให้เราอีกครั้ง"
    th "ทั้งๆที่มีปัญหาชีวิตเหมือนกัน แต่เธอกลับยิ้มได้อย่างสดใส ตรงข้ามกับเราโดยสิ้นเชิง"
    th "สำหรับเราแล้ว แมรี่เป็นคนพิเศษยิ่งกว่าใคร"
    th "การได้ใช้เวลากับเธอทำให้เรารู้สึกว่าโลกนี้ยังมีอะไรดีๆอยู่บ้าง"
    th "เราดีใจจริงๆที่ได้เจอเธอ"
    scene classroom_morning with dissolve
    stop music
    play music 神隠しの真相

    th "วันหนึ่ง ความสัมพันธ์ของพวกเราก็เปลี่ยนแปลงไป"
    yume_th "ถ้าเธอดื่มจากแก้วฉัน มันก็เป็นจูบทางอ้อมพอดีสิ"
    ##voice "audio/voice/final/mary_10_032.mp3"
    mary_th  "แค่นั้นก็อายเหรอ?"
    yume_th "อายสิ"
    ##voice "audio/voice/final/mary_10_033.mp3"
    mary_th "ฮิๆ"
    yume_th "...!!"
    th "เรายังพูดไม่ทันจบ ริมฝีปากก็ถูกหยุดลงก่อน"
    th "กลิ่นอันหอมหวลและปอยผมสีทองยาวสลวยของคนตรงหน้าปลิวไสวไล้เลียใบหน้าของเรา"
    th "สัมผัสนุ่มนวลและอบอุ่นปรากฏขึ้นบนริมฝีปากของเรา ก่อนที่การเชื่อมต่อระหว่างเราสองคนจะถูกคลี่คลายลงเมื่อคนตรงหน้าเลื่อนใบหน้าห่างออกไป"
    th "ใบหน้าของเธอแดงระเรื่อน้อยๆ"
    th "แน่นอนว่าตอนนี้ใบหน้าของเราก็แดงไม่แพ้เธอ"   
    yume_th "เมื่อกี้นี้มัน..."
    ##voice "audio/voice/final/mary_10_034.mp3"
    mary_th "ฉันจะไม่โกหกความรู้สึกของฉันจ้ะ"
    yume_th "....."
    ##voice "audio/voice/final/mary_10_035.mp3"
    mary_th "ฉันน่ะ...ชอบเธอที่สุดเลย..."

    scene sky_morning
    stop music
    play music 手紙のさよなら

    th "แมรี่สารภาพความรู้สึกกับเราว่าเธอคิดกับเรามากกว่าเพื่อน"
    th "สำหรับเรา เราไม่แน่ใจว่าความรู้สึกของเราคือความรักหรือเปล่า แต่สิ่งที่เรามั่นใจคือเราอยากอยู่ข้างๆแมรี่ เราไม่ให้เธอจากเราไปไหน"
    th "การที่มีแมรี่อยู่ข้างๆทำให้เราลืมชีวิตที่เลวร้ายของเรา"
    th "มันทำให้เรามีความสุข เพราะฉะนั้นเราจึงตอบรับความรู้สึกของแมรี่"
    th "...เราคิดว่าเรื่องราวจะจบลงอย่างมีความสุขเท่านั้น..."
    th "...แต่ในความจริงแล้ว...มันไม่ได้ง่ายแบบนั้นเลย..."


    scene black with dissolve
    th "ความรู้สึกเจ็บปวดทรมานค่อยๆเลือนหายไป"
    th "ร่างกายของเราขยับไปตามสัญชาตญาณ"
    th "รู้ตัวอีกทีเราก็เดินผ่านประตูบานหนึ่งและเข้ามาในห้องถัดไปแล้ว"
    scene white with dissolve
    scene fb3_3 with dissolve
    stop music
    play music 廃墟洋館

    th "ท่ามกลางห้องที่น่าคุ้นเคยคือเด็กสาวผมทองที่กำลังรอเราอยู่"
    yume_th "แมรี่"
    ##voice "audio/voice/final/mary_10_036.mp3"
    mary_th "ในที่สุด เธอก็มาถึงห้องสุดท้ายสินะ"
    th "เด็กสาวผมทองส่งยิ้มเศร้าๆให้เรา"
    th "เราเข้าใจแล้ว แท้ที่จริง เธอคนนี้เฝ้าทองเรามาตลอด"
    yume_th "เธอคือแมวตัวนั้น"
    ##voice "audio/voice/final/mary_10_037.mp3"
    mary_th "เรื่องแค่นั้นไม่น่าเดายากจ้ะ"
    th "ไม่มีความเป็นไปได้อื่นอีกแล้ว"
    th "คนกลายร่างเป็นแมวได้เป็นเรื่องที่น่าขำ แต่การมีอยู่ของคฤหาสน์ที่เปลี่ยนฉากในห้องได้อย่างอิสระและมีทางเดินที่ไม่มีจุดสิ้นสุดก็ดูเป็นเรื่องเหนือธรรมชาติอยู่แล้ว"
    th "การที่แมรี่กลายร่างได้อาจจะเป็นเรื่องที่ไม่ผิดแปลกในสถานที่แบบนี้"
    th "ที่สำคัญคือ..."
    yume_th "ที่นี่คือที่ไหนกัน?"
    ##voice "audio/voice/final/mary_10_038.mp3"
    mary_th "อย่าถามคำถามที่เธอแสร้งทำเป็นไม่รู้คำตอบสิ ยูเมะ"
    yume_th "หา?"
    th "เราอุทานขึ้นด้วยความไม่เข้าใจ"
    th "แมรี่กำลังพูดอะไร เธอต้องอะไรจากเรากันแน่"
    ##voice "audio/voice/final/mary_10_039.mp3"
    mary_th "เธอเข้ามาที่นี่โดยที่ไม่มีร่างกายและไม่มีความทรงจำ แต่นั่นน่ะ...มันเกิดจากการรับรู้ที่ผิดพลาดของเธอเอง..."
    yume_th "เธอพูดอะไร...?"
    ##voice "audio/voice/final/mary_10_040.mp3"
    mary_th "จิตใจของเธอไม่สามารถยอมรับกับความเป็นจริงได้ เธอเลยทำเป็นไม่เห็นทุกสิ่งทุกอย่าง"
    yume_th "....."
    ##voice "audio/voice/final/mary_10_041.mp3"
    mary_th "นึกให้ออกสิว่าทำไมฉันถึงอยู่ที่นี่ ทำไมเธอถึงตามฉันมาที่นี่"
    yume_th  "...อึก"
    th "คำพูดของแมรี่ทำให้เรารู้สึกปวดหัว"
    th "ความรู้สึกที่เหมือนสมองจะถูกฉีกเป็นเสี่ยงๆนี่มันอะไร?"
    th "....."
    th "ทันใดนั้น...ภาพตรงหน้าก็มืดดำลงอีกครั้ง..."
    th "...ความทรงจำมากมายกำลังหลั่งไหลกลับมา..."
    scene rouka_main with dissolve
    stop music
    play music house_of_terror 

    th "เวลาผ่านไป เราคบหากับแมรี่มาสองปี"
    th "เราพอใจกับความสัมพันธ์ที่เกิดขึ้น เราเลยเลือกจะอยู่ข้างๆแมรี่โดยไม่สนว่าเราเป็นเพศเดียวกันหรือมีปัญหาทางครอบครัวไม่ต่างกัน"
    th "เราในตอนนั้นอยู่ในห้วงแห่งความสุข จนสุดท้ายก็หมางเมินความจริง"
    th "....."
    scene sky_cloudy with dissolve
    th "วันนั้นเป็นคืนที่ฝนตกหนัก"
    th "เราไปหาแมรี่ที่คฤหาสน์ของเธอ แต่แมรี่มีท่าทางลำบากใจ"
    th "ดูเหมือนว่าแมรี่จะไม่อยากให้เราเจอกับครอบครัวของเธอ"

    scene main_castle with dissolve
    father_th "แกพาใครมาเนี่ย เจ้าลูกไม่ได้เรื่อง?"
    th "ชายวัยกลางคนที่น่าจะเป็นพ่อของแมรี่เดินเข้ามาแทรกระหว่างเรากับแมรี่"
    th "เขาถามแมรี่ก่อนจะมองใบหน้าเราถมึงทึง สายตาแหลมคมของเขาทำให้เรารับรู้ในทันที"
    th "คนๆนี้เป็นตัวอันตราย"
    ##voice "audio/voice/final/mary_10_042.mp3"
    mary_th "พ่อ...พ่อคะ..."
    father_th "ถามก็ตอบสิ อย่ามาอ้ำอึ้ง"
    yume_th "ฉันเป็นแฟนของแมรี่ค่ะ"
    th "เราเห็นแมรี่หวาดกลัวพ่อ เราเลยรีบออกตัวปกป้องเธอ"
    th "ดวงตาของพ่อแมรี่เบิกโพลง"
    th "เราหาได้รู้ไม่เลยว่าเราได้พูดสิ่งที่อันตรายที่สุดออกไป"
    th "ตึงงง!!"
    th "เราไม่อยากเชื่อสายตาตัวเอง"
    th "ภาพที่เราเห็นคือกำปั้นชายวัยกลางคนกระแทกเข้าที่ใบหน้าของผู้หญิงที่เรารัก"
    yume_th "แมรี่!"
    th "เรารีบพยุงร่างของแมรี่ที่โซซัดโซเซ"
    th "เรือนผมสีทองยาวสลวยปรากฏเลือดสีแดงฉานแต่งแต้มเป็นแนวยาว"
    yume_th "นี่คุณทำบ้าอะไร!?"
    th "เราตะคอกใส่พ่อแมรี่ด้วยความเหลืออด แต่เขากลับมองเราด้วยสายตาอาฆาตแค้น"
    th "ความเกลียดชังอันบริสุทธิ์ทะลักออกมาจากแววตาของพ่อแมรี่"
    father_th "แกก็เป็นเหมือนแม่แกอีกคนเหรอ! นังลูกโง่!"
    ##voice "audio/voice/final/mary_10_043.mp3"
    mary_th "...อึก"
    yume_th "หา?"
    th "เขาตะโกนราวกับคนเสียสติ สายตาของเขาไม่ได้มองเรากับแมรี่ตรงๆด้วยซ้ำ"
    th "ชายวัยกลางคนที่ส่งเสียงร้องราวกับสัตว์เดรัจฉานไม่มีผิด"
    father_th "ทำเป็นรักแต่ผู้หญิงเหมือนแม่แก สุดท้ายแกจะหนีตามนังนั่นเหมือนแม่แกอีกคนไหม?"
    ##voice "audio/voice/final/mary_10_044.mp3"
    mary_th "พ่อคะ หนูก็แค่..."
    father_th "ใครๆก็รู้ว่าครอบครัวเราแต่งงานเพื่อธุรกิจ แต่ใครมันจะไปทนอยู่กับพวกวิปริตทางเพศได้วะ"
    ##voice "audio/voice/final/mary_10_045.mp3"
    mary_th "....."
    father_th "แกรู้ไหมว่ามันยุ่งยากแค่ไหนที่ฉันต้องมานั่งลบข่าวฉาวเรื่องแม่แกหนีตามกับผู้หญิงที่เป็นคนรักเก่า แม่แกทำให้ชื่อเสียงของฉันป่นปี้ไปหมด!"

    th "เสียงตะคอกของชายวัยกลางคนแทรกผ่านเข้ามาในโสตประสาทของเรา"
    th "คำพูดเหยียดหยามครอบครัวแท้ๆทำให้ความโกรธแค้นเริ่มกลืนกินเราเข้าไป สำหรับคนที่เกลียดครอบครัวตัวเองเหมือนกัน เราไม่สามารถทนฟังชายคนนี้ด่าทอลูกสาวตัวเองได้"
    th "เรากำหมัดแน่นพร้อมจะผุดลุกขึ้นต่อหน้าพ่อแมรี่"
    th "อย่างไรก็ตาม แมรี่กลับหยุดเราไว้"
    th "เธอมองออกว่าถ้าเราประจันหน้ากับพ่อเธอ จะไม่มีผลลัพธ์ดีๆตามมาทั้งนั้น"

    ##voice "audio/voice/final/mary_10_046.mp3"
    mary_th "ใจเย็นๆก่อน ยูเมะ"
    yume_th "แต่ว่า...!"
    ##voice "audio/voice/final/mary_10_047.mp3"
    mary_th "อย่าลงมือ"
    yume_th "...!!"
    ##voice "audio/voice/final/mary_10_048.mp3"
    mary_th "เธอเคยบอกฉันใช่ไหมว่าเธอจะไม่เป็นอย่างแม่เธอ"
    th "คำพูดของแมรี่เสียดแทงเข้าไปในจิตใจของเรา"
    th "แม้มันจะเป็นคำพูดเมื่อนานมาแล้ว แต่เธอยังคงจำมันได้"
    yume_th "...ฉัน..."
    th "คำพูดของเราขาดห้วงเพราะความคิดอันวุ่นวาย"
    scene black with dissolve
    th "วูบบ!!"
    th "ชั่วพริบตานั้น พ่อของแมรี่ที่บันดาลโทสะก็พุ่งเข้ามาพร้อมกับเหวี่ยงหวัด"
    th "เป้าหมายของเขาไม่มีใครอื่นนอกจากลูกสาวแท้ๆ ผู้เดินตามรอยภรรยาที่เขาเกลียดชัง"
    yume_th "...!!"
    th "ช่วงเวลานั้น เรามีเจตนาเพียงแค่จะปกป้องแมรี่"

    #blood scren
    scene blood with dissolve
    ##voice "audio/voice/final/mary_10_049.mp3"
    mary_th "ไม่นะ!! ยูเมะ!!"
    th "เสียงกรีดร้องของแมรี่ดังขึ้น"
    scene black with dissolve
    th "รู้สึกตัวอีกที เราก็จบชีวิตคนคนหนึ่งไปแล้ว"

    scene fb3_4 with dissolve
    stop music
    play music 廃墟洋館

    ##voice "audio/voice/final/mary_10_050.mp3"
    mary_th "จำได้หรือยังล่ะ?"
    yume_th "...นี่มัน..."
    ##voice "audio/voice/final/mary_10_051.mp3"
    mary_th "เธอต้องการจะปกป้องฉัน แต่อุบัติเหตุได้เกิดขึ้น"
    yume_th "....."
    ##voice "audio/voice/final/mary_10_052.mp3"
    mary_th "เธอผลักพ่อของฉันจนหัวเขากระแทกกลอนประตูโลหะ สาเหตุการตายของพ่อคือเลือดออกในสมอง"
    yume_th "...อึก"
    th "ความรู้สึกผิดในอดีตค่อยๆหลั่งไหลกลับมา"
    th "ท้ายที่สุดเราก็กลายเป็นฆาตกรเหมือนแม่ของเรา"
    th "นี่มันตลกร้ายชัดๆ"
    yume_th "เธอคง...แค้นฉันสินะ..."
    th "แมรี่ทำหน้าเศร้าขณะที่เธอส่ายหน้าปฏิเสธ"
    ##voice "audio/voice/final/mary_10_053.mp3"
    mary_th "เรื่องที่เกิดขึ้นไม่มีใครตั้งใจหรอกจ้ะ"
    yume_th "แมรี่..."
    ##voice "audio/voice/final/mary_10_054.mp3"
    mary_th "ฉันไม่โกรธแค้นเธอหรอก เพราะเธอแค่อยากปกป้องฉันใช่ไหมล่ะ"
    th "รอยยิ้มของแมรี่ทำให้เรารู้สึกผิดบาป"
    th "จริงอยู่ที่พ่อของแมรี่เป็นคนไม่ดี แต่การฆ่าคนก็ยังเป็นการฆ่าคนอยู่ดี"
    th "ตั้งใจหรือไม่ตั้งใจ ฆ่าคนดีหรือคนไม่ดี...ฆาตกรก็ยังเป็นฆาตกร..."
    yume_th  "แล้วหลังจากนั้น...?"
    ##voice "audio/voice/final/mary_10_055.mp3"
    mary_th "เธอถูกจับเข้าเรือนจำข้อหาฆ่าคนตาย"
    yume_th "....."
    ##voice "audio/voice/final/mary_10_056.mp3"
    mary_th "เธอยอมรับโทษแต่โดยดี พวกเราสองคนสัญญากันว่าหลังจากเธอพ้นโทษแล้ว พวกเราจะกลับมาอยู่ด้วยกันอีกครั้งหนึ่ง"
    th "แมรี่ตอบเราด้วยรอยยิ้มเศร้าๆ"
    th "ตั้งแต่วันที่เราจากกัน เวลาผ่านมานานแค่ไหนแล้ว? ที่สำคัญกว่านั้นคือทำไมเราสองคนถึงมาอยู่ในคฤหาสน์ที่ผิดธรรมชาติแบบนี้ได้"
    th "ทุกคำถามในใจล้วนไม่มีคำตอบทั้งสิ้น"
    yume_th  "แล้ว...เรื่องราวต่อจากนั้นล่ะ...?"
    ##voice "audio/voice/final/mary_10_057.mp3"
    mary_th "....."
    yume_th "แมรี่ ตอบฉันที"

    "แมรี่ส่ายหน้าอีกครั้ง"
    ##voice "audio/voice/final/mary_10_058.mp3"
    mary_th  "ฉันตอบคำถามคนที่ไม่รู้ความจริงได้ แต่ฉันไม่สามารถตอบคำถามคนที่ไม่ยอมรับความจริงได้จ้ะ"
    yume_th  "...หา?"
    ##voice "audio/voice/final/mary_10_059.mp3"
    mary_th "ไม่ว่าฉันจะเฉลยตรงๆสักกี่ครั้ง คนไม่ยอมรับความจริงก็จะทำเป็นลืมทุกอย่าง สุดท้ายฉันเลยต้องสร้างวิธีการพิเศษขึ้นมาเพื่อให้เธอค่อยๆกลับมาเป็นตัวเองอีกครั้ง"
    th "วิธีการ?"
    th "อย่าบอกนะว่า โจทย์กับประตูพวกนั้น?"
    yume_th "ฉันก็เป็นตัวเองอยู่แล้วนี่ไง"
    ##voice "audio/voice/final/mary_10_060.mp3"
    mary_th "สำหรับเธอ การตอบปริศนาผ่านประตูอาจจะเป็นครั้งแรก แต่สำหรับฉัน ฉันได้นำทางเธอมาแล้วหลายต่อหลายครั้ง"
    th "คำพูดของแมรี่ทำให้เราเบิกตาโพลง"
    ##voice "audio/voice/final/mary_10_061.mp3"
    mary_th "ทุกครั้งที่เธอใกล้ถึงปลายทาง เธอจะวิ่งหนีจากความจริง และพวกเราก็จะเริ่มใหม่กันอีกครั้ง..."
    yume_th "....."
    ##voice "audio/voice/final/mary_10_062.mp3"
    mary_th "ในมุมมองของเธอ เธออาจจะผ่านเส้นทางนั้นมาครั้งเดียว แต่ในความจริงแล้ว พวกเราทั้งสองได้เดินผ่านประตูพวกนั้นมาไม่รู้กี่สิบกี่ร้อยครั้ง"

    yume_th "..ไม่จริง"
    ##voice "audio/voice/final/mary_10_063.mp3"
    mary_th "มันคือความจริง ยูเมะ"
    yume_th "....."
    ##voice "audio/voice/final/mary_10_064.mp3"
    mary_th "ฉันดีใจนะที่เธอสามารถไขปริศนาทั้งหมดและมาถึงห้องสุดท้ายนี้ได้"

    stop music
    play music crystal_battle
    
    th "แมรี่จับจ้องเราด้วยสายตาขึงขัง "
    th "ความแข็งกร้าวบนใบหน้าที่แสนอ่อนโยนทำให้เรารู้สึกจากใจ"
    th "ผู้หญิงที่เรารักกำลังเดิมพันทุกอย่าง"
    th "...เพื่อช่วยเหลือเรา..."
    ##voice "audio/voice/final/mary_10_065.mp3"
    mary_th "เศษเสี้ยวของความจริงชิ้นสุดท้ายเป็นสิ่งที่ต่อให้ฉันพูดให้เธอฟัง เธอก็จะวิ่งหนีจากมัน...ฉะนั้นเธอจึงมีหน้าที่รับรู้และยอมรับมันด้วยตัวของเธอเอง..."
    yume_th "....."
    ##voice "audio/voice/final/mary_10_066.mp3"
    mary_th "จงตอบปริศนาสุดท้ายและรับรู้ความทรงจำที่แท้จริงด้วยพลังของตัวเองซะ ยูเมะ"
    yume_th "...แมรี่..."
    th "เราพึมพำชื่อของเด็กสาวผมทองตรงหน้า"
    th "นี่คือการเผชิญหน้าระหว่างพวกเราสองคนที่ไม่อาจหลีกเลี่ยง"

    show puzzle10 with dissolve
    jump answer_roome10

    return

label answer_roome10:

    menu:
        "answer":
            $ input_value = renpy.input("Answer?")
            if prepare(input_value) == "diealongside":
                hide puzzle10
                jump common_end
            
            if prepare(input_value) == "liveabeautifullife":
                hide puzzle10
                jump true_end
            
            "ยังไม่ใช่คำตอบที่ถูกนะ"
            jump answer_roome10
        "ใบ้หน่อยสิ":
            "ขอยันข้อสุดท้ายเลยหรอ ไปทำเองไป้"
            hide puzzle10
            jump answer_roome10

