label pv:
    scene rouka_s_1080
    play music 廃墟洋館

    show cat normal with dissolve

    cat normal "สวัสดี เธอตื่นแล้วเหรอ?"
    cat ah "เธอถามว่า...ตัวเธอเป็นใคร? ที่นี่ที่ไหน?"
    cat normal "............."
    cat lick ".....เธอจำไม่ได้อีกแล้วสินะ ฮะๆๆ"
    cat ah "ฉันขอแนะนำก่อนแล้วกัน ที่นี่คือคฤหาสน์ที่เต็มไปด้วยปริศนา ถ้าหากเธอสามารถไขปริศนาได้ทั้งหมดและเดินตามฉันมาถึงสุดปลายทาง เธออาจจะพบกับสิ่งที่เธอตามหาอยู่ "
    cat lick "หืม? เธออยากรู้เฉลยจากฉันเลยงั้นเหรอ"
    cat ah "ฮะๆๆๆ"
    cat normal "เกมปริศนาที่รู้คำตอบตั้งแต่ไม่ฟังคำถามมันจะไปสนุกได้ยังไงกัน"
    cat smile "สิ่งที่ได้มาง่ายเกินไปน่ะไม่มีค่าอะไรหรอก ถ้าหากได้มาจากการขวนขวายมันจะมีเสน่ห์กว่านะ"
    cat normal "ปริศนาง่ายหรือยากงั้นเหรอ?"
    cat lick "ถามแบบนี้แสดงว่ากลัวจะทำไม่ได้ล่ะสิ ฮะๆๆๆ"
    cat smile "ไม่ต้องห่วง ปริศนาในคฤหาสน์แห่งนี้น่ะ แค่อาศัยความพยายามเพียงเล็กน้อย แม้แต่แมวก็ยังทำได้"
    cat ah "เธอพูดอะไรนะ?...กลัวว่าถ้าทำไม่ได้ก็เท่ากับโง่กว่าแมวงั้นเหรอ? "
    cat lick "เธอขี้กลัวกว่าที่ฉันคิดนะ"
    cat normal "ถ้าตอบปริศนาได้แล้ว เธอจะได้อะไรงั้นเหรอ?"
    cat ah "ฉันขอตอบว่า ‘เธอจะได้เศษเสี้ยวของตัวเธอกลับคืนมา’ ก็แล้วกัน"
    cat smile "เอาล่ะ...พวกเราคุยกันนานเกินไปแล้ว..."
    cat ah "ฉันจะนำทางเธอเอง ผู้มาเยือนของฉัน"


    return