
label room06:
    $ _skipping = True
    scene garden_n_1080 with dissolve
    stop music
    play music midnight

    if room06_is_pass == False: 

        "เราจับจ้องโจทย์บนกระดานอย่างไม่วางตา"
        yume "นี่มันดอกพลับพลึง?"
        show cat normal with dissolve
    ##voice "audio/voice/room6/cat_6_000.mp3"
        cat normal "จำชื่อมันได้ด้วยเหรอ?"
        "คำพูดของแมวทำให้เรานึกได้ว่าเราพูดชื่อดอกไม้ในภาพขึ้นมาโดยไม่รู้ตัว"
        "บางสิ่งบางอย่างในตัวเราทำให้เรานึกถึงชื่อของมันได้"
        "เป็นไปได้ไหมที่ดอกไม้นี้จะเกี่ยวพันกับตัวเราในอดีต"
        yume "คงไม่มีทางเลือกอื่นนอกจากต้องตอบคำถามสินะ"
        hide cat
        
        show puzzle6
        jump answer_roome06
        
    else :
        "this room has nothing"
        jump main_map 

label answer_roome06:
    menu:
        "ตอบคำถาม":
            $ input_value = renpy.input("Answer?")
            if prepare(input_value) == "lycorisradiata":
                "ถูกต้อง"
                $ room06_is_pass = True
                "ภาพดอกไม้เลือนหายไป ภาพอดีตปรากฏขึ้นอีกครั้ง"
                hide puzzle6
                jump after_room_6
            if prepare(input_value) == "spiderlily":
                "ตอบเป็นชื่อวิทยาศาสตร์"
                jump answer_roome06
            if prepare(input_value) == "sunflower":
                "อะไรที่มันแทนที่ดอกทานตะวันกันนะ?"
                jump answer_roome06
            else :
                "ผิดจ้า"
                jump answer_roome06
        "ใบ้หน่อยสิ":
            "เหมือนฉันเคยได้ยินบทกวีนี้นะ แต่เอ้ะ เหมือนมีอะไรต่างจากต้นฉบับอยู่"
            jump answer_roome06
        "กลับห้องโถง":
            hide puzzle6
            jump main_map

label after_room_6:

    scene fb2_3 with dissolve
    stop music
    play music lost

    "ดวงตาของใครสักคนหนึ่งกำลังมองดอกไม้ใกล้ตัวเรา"
    "แววตาส่องประกายแสดงให้เห็นถึงความชื่นชอบที่เธอคนนั้นมีต่อดอกไม้สีขาวบริสุทธิ์"
    yume "เธอดูชอบมันนะ"
    ##voice "audio/voice/room6/mary_6_000.mp3"
    mary0 "หืม?"
    "เราทักเธอขึ้นทำให้เธอหันมามองหน้าเรา"
    "เธอเอียงคอน้อยๆด้วยความสงสัยว่าเราเรียกเธอทำไมเพราะปกติเราไม่ค่อยชวนเธอคุยก่อน"
    yume "ทำไมเธอถึงชอบดอกไม้นั่นล่ะ?"
    ##voice "audio/voice/room6/mary_6_001.mp3"
    mary0 "ไม่มีเหตุผลหรอกจ้ะ มันแค่สวยดี"
    yume "ดอกพลับพลึงสีแดงมีความหมายไม่ดีเท่าไหร่หรอกนะ"
    ##voice "audio/voice/room6/mary_6_002.mp3"
    mary0 "แต่ที่ฉันชอบมันคือสีขาวนี้จ้ะ แล้วภาษาดอกไม้ของมันก็ไม่เหมือนกับสีแดงด้วย"
    yume "สีแดงสื่อถึงความตาย แล้วสีขาวสื่อถึงอะไรล่ะ?"
    ##voice "audio/voice/room6/mary_6_003.mp3"
    mary0 "ความหมายของมันโรแมนติคมากเลยล่ะ"
    yume "โรแมนติค?"
    "สัมผัสอบอุ่นปรากฏขึ้นบนหลังมือของเราในอดีต"
    "มือของคนตรงหน้าวางลงบนหลังมือเราอย่างอ่อนโยนโดยที่เราไม่ทันตั้งตัว"
    ##voice "audio/voice/room6/mary_6_004.mp3"
    mary0 "ความหมายของมันคือ ‘ฉันปรารถนาแค่เธอคนเดียว’ จ้ะ"
    yume "...อึก"
    ##voice "audio/voice/room6/mary_6_005.mp3"
    mary0 "หน้าแดงง่ายจังนะจ้ะ"
    yume "อย่ามาล้อเล่นกันสิ"
    ##voice "audio/voice/room6/mary_6_006.mp3"
    mary0 "ถ้าไม่ได้ล้อเล่นจะเป็นไงกันนะ?"
    yume "ในอดีตสะดุ้งเฮือกเล็กๆ"
    "ความเขินอายที่แทรกมากะทันหันทำให้เราเม้มปากแน่น"
    yume "เธอนี่ขี้แกล้งชะมัด"
    ##voice "audio/voice/room6/mary_6_007.mp3"
    mary0 "เธอก็หัวทึบพอสมควรเลยจ้ะ"
    yume "พูดแบบนี้หมายความว่ายังไง? หา?"
    "เธอคนนั้นไม่ได้ตอบคำถามของเรา"
    "เธอเพียงแค่หัวเราะเสียงใสดังกังวานให้เราเท่านั้น"

    scene garden_n_1080 with dissolve
    stop music
    play music midnight

    yume "....."
    "ความทรงจำที่ชวนให้รำลึกถึงค่อยๆเพิ่มขึ้น"
    "ช่วงเวลาที่ทำให้มีความสุข ชวนให้เราถวิลหาถึงตัวตนในอดีตมากกว่าเดิม"
    show cat normal with dissolve
    ##voice "audio/voice/room6/cat_6_001.mp3"
    cat normal "เธอรู้ไหมว่าดอกพลับพลึงสีขาวมีความหมายว่าอะไร?"
    "เจ้าแมวส้มเอ่ยคำถามที่เสียดแทงเข้ามาในใจเรา"
    "หลายครั้งแล้วที่มันเหมือนกับกำลังอ่านใจเราอยู่ไม่มีผิด"
    yume "ฉันปรารถนาแค่เธอคนเดียว"
    ##voice "audio/voice/room6/cat_6_002.mp3"
    cat lick "มันยังมีอีกความหมายหนึ่ง"
    yume "คือ?"
    ##voice "audio/voice/room6/cat_6_003.mp3"
    cat normal "ฉันเฝ้ารอวันที่จะมาพบกันอีกครั้ง"
    "ความหมายที่สองทำให้เรารู้สึกเหมือนหัวใจกระตุกวูบ"
    "ทั้งๆที่ไม่มีร่างกายแล้ว แต่ความเจ็บปวดนี่มันอะไรกันนะ?"
    "เจ้าแมวส้มพูดแค่นั้นแล้วมันก็เดินนำหน้าเราไปยังประตูอีกฝั่ง"
    "...สู่ประตูต่อไป..."

    hide cat

    jump cutscene_main




