
label room07:   
    $ _skipping = True
    scene garden_n_1080 with dissolve
    stop music
    play music 廃墟洋館

    if room07_is_pass == False: 
        show cat normal with dissolve
    ##voice "audio/voice/room7/cat_7_000.mp3"
        cat_th normal "เธอชอบดูดาวหรือเปล่าล่ะ?"
        th "คำถามของแมวส้มทำให้เรานึกถึงความทรงจำบางอย่าง"
        th "เมื่อสมัยก่อนเคยมีใครถามเราแบบนี้หรือเปล่านะ?"
        yume_th "เฉยๆน่ะ"
    ##voice "audio/voice/room7/cat_7_001.mp3"
        cat_th normal "ทั้งๆที่ปากบอกเฉยๆ แต่น้ำเสียงมีแต่อารมณ์หม่นๆนะ"
        yume_th  "....."
    ##voice "audio/voice/room7/cat_7_002.mp3"
        cat_th smile "ไม่ต้องคิดมากหรอกจ้ะ มองโจทย์สักพักก็เข้าใจเอง"
        scene star3 with dissolve
        yume_th  "ฉันเห็นแต่แสงสว่างยุ่บยั่บเต็มไปหมด"
    ##voice "audio/voice/room7/cat_7_003.mp3"
        cat_th ah "คำตอบมันก็อยู่ในแสงสว่างท่ามกลางท้องฟ้าสีดำพวกนั้นล่ะ"
        yume_th  "คำตอบครั้งนี้น่าจะหายากพอสมควร"
    ##voice "audio/voice/room7/cat_7_004.mp3"
        cat_th lick "..."
        yume_th  "เงียบทำไมล่ะ?"
        "เจ้าแมวส้มเบิกตากว้างขึ้นน้อยๆก่อนจะพูดขึ้น"
    ##voice "audio/voice/room7/cat_7_005.mp3"
        cat_th ah  "เธอดูพูดเก่งขึ้นนะ"
        yume_th  "เหรอ?"
    ##voice "audio/voice/room7/cat_7_006.mp3"
        cat_th lick "เริ่มเข้าใจตัวเองมากขึ้นแล้วหรือเปล่าเลยต่อปากต่อคำเก่งขึ้นน่ะ?"
        th "แมวส้มถามลองใจเรา แต่เรากลับตอบมันได้แค่ความเงียบ"
        th "เรายังไม่แน่ใจหรอกว่าเราตอนนี้ใกล้เคียงกับเราตัวจริงมากแค่ไหน"
        yume_th "ขอเวลาสักพัก ฉันจะตอบข้อนี้ได้เอง"
    ##voice "audio/voice/room7/cat_7_007.mp3"
        cat_th smile  "จะรอดูนะ"
        th "เจ้าแมวส้มส่งยิ้มให้เรา"

        show puzzle7
        jump answer_roome07
    
    else :
        th "this room has nothing"
        jump main_map 

label answer_roome07:
    menu:
        "answer":
            $ input_value = renpy.input("Answer?")
            if prepare(input_value) == "orion":
                $ room07_is_pass = True
                th "ท้องฟ้าสีดำที่เต็มไปด้วยดวงดาวเปลี่ยนผันกลายเป็นฉากขาว"
                th "ความทรงจำในอดีตกำลังหลั่งไหลเข้ามาอีกครั้งราวกับสายน้ำ"

                hide puzzle7
                jump after_room_7
            else :
                th "it's not answer"
                jump answer_roome07
        "ใบ้หน่อยสิ":
            th "เหมือนฉันจะเห็นดาวสีน้ำเงินเข้มอยู่ในภาพนะ ดูผิดธรรมชาติมากเลย"
            jump answer_roome07
        "กลับห้องโถง":
            hide puzzle7
            jump main_map

label after_room_7:
    scene fb2_4 with dissolve
    stop music
    play music 神隠しの真相

    ##voice "audio/voice/room7/mary_7_000.mp3"
    mary0_th "เธอชอบดูดาวหรือเปล่าล่ะ?"
    yume_th "หา?"
    ##voice "audio/voice/room7/mary_7_001.mp3"
    mary0_th "จะ ‘หา’ ทำไมล่ะจ้ะ? ฉันก็ถามอะไรตรงไปตรงมานี่"
    yume_th "ไม่ได้ชอบเป็นพิเศษหรอก"
    ##voice "audio/voice/room7/mary_7_002.mp3"
    mary0_th "แล้วทำไมมาดูกับฉันล่ะจ้ะ?"
    yume_th "ก็..."
    ##voice "audio/voice/room7/mary_7_003.mp3"
    mary0_th "ก็...?"
    yume_th "ปล่อยให้ผู้หญิงคนเดียวมาดูดาวที่เปลี่ยวตอนกลางคืนมันอันตรายนี่นา"
    ##voice "audio/voice/room7/mary_7_004.mp3"
    mary0_th "......."
    "ความเงียบก่อตัวขึ้นระหว่างเราสองคนสักพัก"
    "ไม่นานหลังจากนั้น มือบางของอีกฝ่ายก็วางลงบนศีรษะเราเบาๆ"
    yume_th "เฮ้ย จะจับหัวฉันทำไม?"
    ##voice "audio/voice/room7/mary_7_005.mp3"
    mary0_th "ฉันรู้จ้ะว่าเธอไม่ชอบให้คนอื่นแตะตัว แต่เธอตอนนี้น่ารักดีจ้ะเลยเผลอลูบหัว"
    yume_th "พิลึกจริง"
    ##voice "audio/voice/room7/mary_7_006.mp3"
    mary0_th "งั้นเรามาทายปริศนากันดีกว่า"
    yume_th "ปริศนาอีกแล้วเรอะ?"
    ##voice "audio/voice/room7/mary_7_007.mp3"
    mary0_th "อย่าทำหน้าเบื่อโลกสิจ้ะ"
    yume_th "ขนาดเลิกเรียนแล้วก็ยังมานั่งทายปริศนาชวนหัว ชีวิตฉันต้องไขปริศนาไปถึงเมื่อไหร่กัน?"
    ##voice "audio/voice/room7/mary_7_008.mp3"
    mary0_th "จนกว่าฉันจะขี้เกียจถามเธอจ้ะ"
    yume "สรุปง่ายๆคือจนกว่าพวกเราจะตายกันสักข้างสินะ"
    ##voice "audio/voice/room7/mary_7_009.mp3"
    mary0_th "เอาล่ะ...กลุ่มดาวดวงนั้นคือกลุ่มดาวอะไรจ้ะ?"
    yume_th "ไม่ได้ฟังฉันสักแอะเลยนี่หว่า"
    "เราถอนหายใจเบาๆแต่ก็ยอมมองตามนิ้วของคนข้างตัวแต่โดยดี"
    ##voice "audio/voice/room7/mary_7_010.mp3"
    mary0_th "ลองทายดูสิ ข้อนี้ไม่ยา..."
    yume_th "กลุ่มดาวนายพรานสินะ"
    th "คำตอบอันรวดเร็วของเราทำให้อีกฝ่ายดูประหลาดใจไม่น้อย"
    th "เธอคงคาดหวังว่าเราจะตอบไม่ได้แล้วให้เธอสอนเราแหงๆ มุกนี้โดนมาเยอะแล้ว"
    yume_th "เอามือมาวางบนหน้าผากฉันทำไม?"
    ##voice "audio/voice/room7/mary_7_011.mp3"
    mary0_th "เธอฉลาดผิดปกติเลยนึกว่าไข้ขึ้นอ่ะจ้ะ"
    yume_th "ตอบผิดก็โดนว่าโง่ ตอบผิดก็หาว่าป่วย นี่มันทั้งขึ้นทั้งล่องชัดๆ"
    ##voice "audio/voice/room7/mary_7_012.mp3"
    mary0_th "ล้อเล่นจ้ะๆ ว่าแต่เธอรู้ได้ไงจ้ะ?"
    yume_th "กลุ่มดาวนี้มันดังอยู่ ฉันพอจะรู้จักน่ะ"
    ##voice "audio/voice/room7/mary_7_013.mp3"
    mary0_th "เดาว่าอ่านการ์ตูนมาเลยจำได้แหงๆจ้ะ"
    yume_th "รู้ได้ไง...ไม่สิ อย่าคิดว่าฉันจะตื้นเขินขนาดนั้นสิ"
    ##voice "audio/voice/room7/mary_7_014.mp3"
    mary0_th "ไม่เนียนเลยจ้ะ"
    th "เด็กสาวข้างตัวหัวเราะเสียงใส ทำให้เรารู้สึกหน้าอุ่นขึ้นอย่างควบคุมไม่ได้"
    th "สักพักหลังจากนั้น คนข้างกายเราก็หุบยิ้มลงและจ้องหน้าเรา"

    stop music
    play music 手紙のさよなら
    
    ##voice "audio/voice/room7/mary_7_015.mp3"
    mary0_th "ช่วงนี้เธอดูเครียดๆนะจ้ะ"
    yume_th "....."
    th "เราหุบปากเงียบลง"
    th "ทั้งๆที่เมื่อครู่ยังแสดงความขี้เล่นออกมาแท้ๆ แต่ตอนนี้คนข้างตัวเรากลับมองเราด้วยสายตาเจนจัด"
    th "อย่างกับคนคนนี้มองทะลุผ่านเราไม่มีผิด"
    yume_th "เรื่องเดิมๆน่ะ"
    ##voice "audio/voice/room7/mary_7_016.mp3"
    mary0_th "ปัญหาที่บ้านเหรอจ้ะ?"
    th "คำกล่าวของเด็กสาวข้างกายเสียดแทงใจเรา"
    th "เราไม่สามารถปิดบังจิตใจของเราจากเธอได้จริงๆ"
    yume_th "มองออกตลอดเลยนะ"
    ##voice "audio/voice/room7/mary_7_017.mp3"
    mary0_th "คนที่มีปัญหาคล้ายๆกันจะเข้าใจกันดีจ้ะ"
    th "เด็กสาวยิ้มเศร้าๆให้เรา"
    th "เราได้ยินเสียงถอนใจจากคู่สนทนาที่เงยหน้ามองฟ้าด้วยสายตาเหม่อลอย"
    yume_th "พ่อของฉันขโมยของคนอื่นจนต้องเข้าคุกเข้าตะรางอีกแล้ว"
    ##voice "audio/voice/room7/mary_7_018.mp3"
    mary0_th "....."
    yume_th "ตั้งแต่แม่ก่อคดีรุนแรงและตายไป พ่อก็เปลี่ยนไปเหมือนอีกคนหนึ่งเลย" 
    ##voice "audio/voice/room7/mary_7_019.mp3"
    mary0_th "....."
    yume_th "ชีวิตมันห่วยแตกเนอะ"
    th "เด็กสาวข้างกายเราไม่ได้พูดอะไรมากความ เธอเพียงแค่ยื่นมือมาลูบศีรษะเราเบาๆอีกครั้งหนึ่ง"
    th "ปกติแล้วเราไม่ชอบให้ใครมาแตะตัวเรา แต่สัมผัสของเธอช่างอบอุ่นจริงๆ"
    yume_th "บอกแล้วไงว่าอย่าลูบหัวฉัน"
    ##voice "audio/voice/room7/mary_7_020.mp3"
    mary0_th "ไม่ฟังหรอกจ้ะ"
    yume_th "หา?"
    ##voice "audio/voice/room7/mary_7_021.mp3"
    mary0_th "จะห้ามไม่ให้ปลอบใจคนที่ทำหน้าเหมือนจะร้องไห้น่ะ ฉันทำไม่ลงหรอกจ้ะ"
    th "เราพูดอะไรไม่ออกแม้แต่คำเดียว"
    th "รู้ตัวอีกที เราก็เลื่อนตัวเข้าใกล้คนข้างกายและก้มหน้าซุกกับแขนเสื้อเธอแล้ว"
    ##voice "audio/voice/room7/mary_7_022.mp3"
    mary0_th "น่าจะเป็นฝนตกล่ะนะ"
    yume_th "ฝน?"
    ##voice "audio/voice/room7/mary_7_023.mp3"
    mary0_th "เพราะฝนตก แขนเสื้อฉันเลยชื้นไปหมดน่ะ"
    yume_th "....."
    ##voice "audio/voice/room7/mary_7_024.mp3"
    mary0_th "ฉันไม่เห็นอะไรทั้งนั้นจ้ะ" 
    th "เราได้แต่พยักหน้ารับทั้งๆที่ดวงตาของเราชนกับชายเสื้อของเธอ"
    th "ความรู้สึกตื้นตันทะลักทลายอย่างหยุดไม่ได้ สายฝนแห่งความรู้สึกพรั่งพรูออกมา"
    ##voice "audio/voice/room7/mary_7_025.mp3"
    mary0_th "ฉันจะอยู่กับเธอจนกว่าฝนจะหยุดตกเองจ้ะ"
    yume_th "ขอบคุณนะ"
    ##voice "audio/voice/room7/mary_7_026.mp3"
    mary0_th "ไม่เป็นไรจ้ะ"
    th "สัมผัสอันอ่อนโยนวางประทับเหนือศีรษะของเรา"
    th "อ้อมกอดของเธอทำให้เรารู้สึกไม่ได้อยู่ตัวคนเดียวอีกต่อไป"

    scene garden_n_1080 with dissolve
    stop music
    play music 泣カナイデ

    yume_th "...อึก"
    th"ทั้งๆที่เราไม่ควรจะมีร่างกาย แต่ความเปียกชื้นที่เกิดขึ้นนี่มันอะไรกันนะ?"
    th "น้ำตาเหรอ?"
    th "...ทำไมกัน?"
    th "...ทั้งๆที่คนคนนั้นอ่อนโยนกับเราขนาดนั้น ทำไมเราถึงลืมเธอลง?"
    th "...ทำไม?"

    show cat normal with dissolve

    ##voice "audio/voice/room7/cat_7_008.mp3"
    cat_th lick "ไปต่อกันเถอะจ้ะ"
    yume_th "...เจ้าแมว..."
    ##voice "audio/voice/room7/cat_7_009.mp3"
    cat_th smile  "มาถึงตรงนี้ พวกเราถอยไม่ได้แล้วล่ะจ้ะ"
    yume_th "....."
    th "เจ้าแมวพูดถูก"
    th "ถึงความรู้สึกอึดอัดจะก่อตัวขึ้น ถึงความหมองหม่นจะไม่หายไป แต่ถ้ายังไม่ไปถึงปลายทาง เราก็ไม่รู้ว่าบทสรุปที่แท้จริงคืออะไรกัน"

    hide cat
    jump cutscene_main

    
 
    
