label intro:
    scene rouka_s_1080
    play music 廃墟洋館
    "... เส้นทางที่ไม่รู้จุดหมายทอดยาวต่อหน้าเรา..."
    "ที่นี่คือที่ไหนกัน?"
    "ตัวเราคือใครกัน?"
    "....."
    "ความมืดมิดโอบล้อมรอบร่างกายจนกระทั่งเราลืมตาตื่นขึ้น"
    "ทัศนะการมองเห็นค่อยๆกลับมาแจ่มชัด"
    "ร่างกายที่รู้สึกหนักหน่วงค่อยๆเบาบางลง"
    "สิ่งแรกที่เราทำหลังจากหยั่งยืนบนพื้นทางเดินอันมืดมนคือจ้องมองแขนขาและเรือนร่างของตัวเอง"
    yume "นี่มัน...."
    "น้ำเสียงของเราแหบพร่าอย่างผิดปกติ"
    "แต่สิ่งที่น่าประหลาดยิ่งกว่านั้นคือร่างกายของเรากลับมีเพียงความว่างเปล่า"

    yume "...ทำ...ไม...?"
    "คำพูดของเราขาดห้วง"
    "ทั้งๆที่เราประสาทสัมผัสบอกเราว่าร่างกายของเรามีอยู่จริง ทั้งแขนทั้งขากำลังขยับตามคำสั่งของเราทุกประการ แต่เมื่อจ้องมองไปยังส่วนที่ควรจะเป็นเรือนร่าง เรากลับพบเพียงอากาศธาตุเท่านั้น"
    "ร่างกาย...ของเรา...?"
    "...นี่เรากำลังล่องหนอยู่เหรอ?"
    "...หรือว่าเราไม่มีร่างกายตั้งแต่แรก?"
    "เราพยายามนึกถึงเหตุผลที่ทำไมเรามาอยู่ตรงนี้ แต่ไม่ว่าพยายามนึกถึงเท่าไหร่ก็นึกไม่ออก"

    "ที่นี่คือสถานที่ที่เราไม่รู้จัก"
    "มันทั้งมืดมิด ทั้งหนาวเหน็บและวังเวงไร้ผู้คน"

    yume "....."
    "ต้นกำเนิดแสงหนึ่งเดียวมีเพียงแสงสว่างที่ทอดผ่านหน้าต่างบานใหญ่ลงมา"
    scene moonlight3 with dissolve
    "ดวงจันทร์สีเงินขนาดใหญ่สาดทอแสง ราวกับมันกำลังจ้องมองเราจากเบื้องบนไม่มีผิด"

    "....."
    "เราก้มมองร่างกายของตัวเองที่เหลือเพียงความว่างเปล่าพร้อมกับตั้งคำถาม"
    "ไม่ใช่เพียงร่างกายที่หายไป แต่ความทรงจำข้างในก็กลวงเปล่าเช่นกัน"
    "...นี่เรา...เป็นใครกัน?"
    "....."
    scene rouka_s_1080 with dissolve
    cat0 "ไม่มีใครมาที่นี่นานแล้ว"
    yume "นั่นเสียงใคร?"
    cat0  "ก้มลงมองข้างล่างสิ"
    
    stop music
    play music 不穏
    
    show cat normal with dissolve
    "เราเผลอมองตามคำพูดลึกลับด้วยความอยากรู้อยากเห็น"
    "เจ้าของเสียงเล็กแหลมที่ดังขึ้นข้างกายเรามีขนาดเล็กจ้อยพอๆกับสองฝ่ามือคนเท่านั้น"

    yume "...แมว?"
    "เราอุทานขึ้นด้วยความตกใจเพราะไม่เคยเห็นสัตว์พูดได้มาก่อน"
    "เจ้าแมวลายส้มหรี่ตามองเราราวกับไม่สบอารมณ์น้อยๆ"

    cat fun "ไม่ใช่แมว แต่เป็นผู้นำทางต่างหาก"  with dissolve
    yume "ผู้นำทาง?"
    "แมวลายส้มตากลมโตจ้องมองเราด้วยความประหลาดใจ"
    "ทั้งๆที่แมวไม่ควรจะแสดงสีหน้าได้ชัดเจน แต่แมวตัวนี้กลับแสดงอารมณ์ได้ราวกับเป็นคน"


    cat ah "ดูเหมือนว่าเธอจะไม่รู้อะไรเลยสินะ" with dissolve 
    yume "ฉัน?"
    "เราพูดขึ้นด้วยความสงสัย"
    "เมื่อถูกถามคำถามนั้น เราก็พยายามนึกถึงเรื่องของตัวเองเพื่อให้ตอบคำถามได้"

    yume "...อึก!!"
    "ทันใดที่เราพยายามนึกถึงบางสิ่ง ความเจ็บปวดทรมานก็แล่นไปทั่ว"
    "ร่างกายที่ไม่มีอยู่จริงกำลังต่อต้านเจตจำนงของตัวเอง"
    "...นี่มัน...อะไรกัน...?"

    cat bored "เธออย่าฝืนจะดีกว่า" with dissolve
    yume "ฝืน?"
    cat normal "ตอนนี้เธอไม่สามารถนึกได้หรอกว่าตัวเธอเป็นใคร"
    yume "....."

    cat itasura "ถ้าเธออยากได้คำตอบว่าเธอเป็นใคร ทำไมเธอถึงอยู่ที่นี่ เธอมีทางเลือกเดียวเท่านั้น" with dissolve
    yume "ทางเลือก?"
    cat  normal "ตามฉันมา" with dissolve

    jump room0

label room0:
    "some text"
    "problem 0"
    show puzzle0
    jump answer_roome0



label answer_roome0:
    menu:
        "answer":
            "try"
            $ input_value = renpy.input("Answer?")
            if input_value == "pathaway":
                "pass"
                hide puzzle0
                jump main_map
            else :
                "it's not answer"
                jump answer_roome0
    
