
label room07:

    scene library_s_1080 with dissolve
    stop music
    play music 廃墟洋館

    if room07_is_pass == False: 
        show cat normal with dissolve
        cat normal "เธอชอบดูดาวหรือเปล่าล่ะ?"
        "คำถามของแมวส้มทำให้เรานึกถึงความทรงจำบางอย่าง"
        "เมื่อสมัยก่อนเคยมีใครถามเราแบบนี้หรือเปล่านะ?"
        yume "เฉยๆน่ะ"
        cat normal "ทั้งๆที่ปากบอกเฉยๆ แต่น้ำเสียงมีแต่อารมณ์หม่นๆนะ"
        yume  "....."
        cat normal "ไม่ต้องคิดมากหรอกจ้ะ มองโจทย์สักพักก็เข้าใจเอง"
        yume  "ฉันเห็นแต่แสงสว่างยุ่บยั่บเต็มไปหมด"
        cat normal "คำตอบมันก็อยู่ในแสงสว่างท่ามกลางท้องฟ้าสีดำพวกนั้นล่ะ"
        yume  "คำตอบครั้งนี้น่าจะหายากพอสมควร"
        cat normal "..."
        yume  "เงียบทำไมล่ะ?"
        "เจ้าแมวส้มเบิกตากว้างขึ้นน้อยๆก่อนจะพูดขึ้น"
        cat normal  "เธอดูพูดเก่งขึ้นนะ"
        yume  "เหรอ?"
        cat normal "เริ่มเข้าใจตัวเองมากขึ้นแล้วหรือเปล่าเลยต่อปากต่อคำเก่งขึ้นน่ะ?"
        "แมวส้มถามลองใจเรา แต่เรากลับตอบมันได้แค่ความเงียบ"
        "เรายังไม่แน่ใจหรอกว่าเราตอนนี้ใกล้เคียงกับเราตัวจริงมากแค่ไหน"
        yume "ขอเวลาสักพัก ฉันจะตอบข้อนี้ได้เอง"
        cat normal  "จะรอดูนะ"
        "เจ้าแมวส้มส่งยิ้มให้เรา"

        show puzzle7
        jump answer_roome07
    
    else :
        "this room has nothing"
        jump main_map 

label answer_roome07:
    menu:
        "answer":
            "try"
            $ input_value = renpy.input("Answer?")
            if prepare(input_value) == "orion":
                $ room07_is_pass = True
                "ท้องฟ้าสีดำที่เต็มไปด้วยดวงดาวเปลี่ยนผันกลายเป็นฉากขาว"
                "ความทรงจำในอดีตกำลังหลั่งไหลเข้ามาอีกครั้งราวกับสายน้ำ"

                hide puzzle7
                jump after_room_7
            else :
                "it's not answer"
                jump answer_roome07
        "return":
            hide puzzle7
            jump main_map

label after_room_7:
    scene flashback with dissolve
    stop music
    play music 神隠しの真相

    mary0 "เธอชอบดูดาวหรือเปล่าล่ะ?"
    yume "หา?"
    mary0 "จะ ‘หา’ ทำไมล่ะจ้ะ? ฉันก็ถามอะไรตรงไปตรงมานี่"
    yume "ไม่ได้ชอบเป็นพิเศษหรอก"
    mary0 "แล้วทำไมมาดูกับฉันล่ะจ้ะ?"
    yume "ก็..."
    mary0 "ก็...?"
    yume "ปล่อยให้ผู้หญิงคนเดียวมาดูดาวที่เปลี่ยวตอนกลางคืนมันอันตรายนี่นา"
    mary0 "......."
    "ความเงียบก่อตัวขึ้นระหว่างเราสองคนสักพัก"
    "ไม่นานหลังจากนั้น มือบางของอีกฝ่ายก็วางลงบนศีรษะเราเบาๆ"
    yume "เฮ้ย จะจับหัวฉันทำไม?"
    mary0 "ฉันรู้จ้ะว่าเธอไม่ชอบให้คนอื่นแตะตัว แต่เธอตอนนี้น่ารักดีจ้ะเลยเผลอลูบหัว"
    yume "พิลึกจริง"
    mary0 "งั้นเรามาทายปริศนากันดีกว่า"
    yume "ปริศนาอีกแล้วเรอะ?"
    mary0 "อย่าทำหน้าเบื่อโลกสิจ้ะ"
    yume "ขนาดเลิกเรียนแล้วก็ยังมานั่งทายปริศนาชวนหัว ชีวิตฉันต้องไขปริศนาไปถึงเมื่อไหร่กัน?"
    mary0 "จนกว่าฉันจะขี้เกียจถามเธอจ้ะ"
    yume "สรุปง่ายๆคือจนกว่าพวกเราจะตายกันสักข้างสินะ"
    mary0 "เอาล่ะ...กลุ่มดาวดวงนั้นคือกลุ่มดาวอะไรจ้ะ?"
    yume "ไม่ได้ฟังฉันสักแอะเลยนี่หว่า"
    "เราถอนหายใจเบาๆแต่ก็ยอมมองตามนิ้วของคนข้างตัวแต่โดยดี"
    mary0 "ลองทายดูสิ ข้อนี้ไม่ยา..."
    yume "กลุ่มดาวนายพรานสินะ"
    "คำตอบอันรวดเร็วของเราทำให้อีกฝ่ายดูประหลาดใจไม่น้อย"
    "เธอคงคาดหวังว่าเราจะตอบไม่ได้แล้วให้เธอสอนเราแหงๆ มุกนี้โดนมาเยอะแล้ว"
    yume "เอามือมาวางบนหน้าผากฉันทำไม?"
    mary0 "เธอฉลาดผิดปกติเลยนึกว่าไข้ขึ้นอ่ะจ้ะ"
    yume "ตอบผิดก็โดนว่าโง่ ตอบผิดก็หาว่าป่วย นี่มันทั้งขึ้นทั้งล่องชัดๆ"
    mary0 "ล้อเล่นจ้ะๆ ว่าแต่เธอรู้ได้ไงจ้ะ?"
    yume "กลุ่มดาวนี้มันดังอยู่ ฉันพอจะรู้จักน่ะ"
    mary0 "เดาว่าอ่านการ์ตูนมาเลยจำได้แหงๆจ้ะ"
    yume "รู้ได้ไง...ไม่สิ อย่าคิดว่าฉันจะตื้นเขินขนาดนั้นสิ"
    mary0 "ไม่เนียนเลยจ้ะ"
    "เด็กสาวข้างตัวหัวเราะเสียงใส ทำให้เรารู้สึกหน้าอุ่นขึ้นอย่างควบคุมไม่ได้"
    "สักพักหลังจากนั้น คนข้างกายเราก็หุบยิ้มลงและจ้องหน้าเรา"

    stop music
    play music 手紙のさよなら
    
    mary0 "ช่วงนี้เธอดูเครียดๆนะจ้ะ"
    yume "....."
    "เราหุบปากเงียบลง"
    "ทั้งๆที่เมื่อครู่ยังแสดงความขี้เล่นออกมาแท้ๆ แต่ตอนนี้คนข้างตัวเรากลับมองเราด้วยสายตาเจนจัด"
    "อย่างกับคนคนนี้มองทะลุผ่านเราไม่มีผิด"
    yume "เรื่องเดิมๆน่ะ"
    mary0 "ปัญหาที่บ้านเหรอจ้ะ?"
    "คำกล่าวของเด็กสาวข้างกายเสียดแทงใจเรา"
    "เราไม่สามารถปิดบังจิตใจของเราจากเธอได้จริงๆ"
    yume "มองออกตลอดเลยนะ"
    mary0 "คนที่มีปัญหาคล้ายๆกันจะเข้าใจกันดีจ้ะ"
    "เด็กสาวยิ้มเศร้าๆให้เรา"
    "เราได้ยินเสียงถอนใจจากคู่สนทนาที่เงยหน้ามองฟ้าด้วยสายตาเหม่อลอย"
    yume "พ่อของฉันขโมยของคนอื่นจนต้องเข้าคุกเข้าตะรางอีกแล้ว"
    mary0 "....."
    yume "ตั้งแต่แม่ก่อคดีรุนแรงและตายไป พ่อก็เปลี่ยนไปเหมือนอีกคนหนึ่งเลย" 
    mary0 "....."
    yume "ชีวิตมันห่วยแตกเนอะ"
    "เด็กสาวข้างกายเราไม่ได้พูดอะไรมากความ เธอเพียงแค่ยื่นมือมาลูบศีรษะเราเบาๆอีกครั้งหนึ่ง"
    "ปกติแล้วเราไม่ชอบให้ใครมาแตะตัวเรา แต่สัมผัสของเธอช่างอบอุ่นจริงๆ"
    yume "บอกแล้วไงว่าอย่าลูบหัวฉัน"
    mary0 "ไม่ฟังหรอกจ้ะ"
    yume "หา?"
    mary0 "จะห้ามไม่ให้ปลอบใจคนที่ทำหน้าเหมือนจะร้องไห้น่ะ ฉันทำไม่ลงหรอกจ้ะ"
    "เราพูดอะไรไม่ออกแม้แต่คำเดียว"
    "รู้ตัวอีกที เราก็เลื่อนตัวเข้าใกล้คนข้างกายและก้มหน้าซุกกับแขนเสื้อเธอแล้ว"
    mary0 "น่าจะเป็นฝนตกล่ะนะ"
    yume "ฝน?"
    mary0 "เพราะฝนตก แขนเสื้อฉันเลยชื้นไปหมดน่ะ"
    yume "....."
    mary0 "ฉันไม่เห็นอะไรทั้งนั้นจ้ะ" 
    "เราได้แต่พยักหน้ารับทั้งๆที่ดวงตาของเราชนกับชายเสื้อของเธอ"
    "ความรู้สึกตื้นตันทะลักทลายอย่างหยุดไม่ได้ สายฝนแห่งความรู้สึกพรั่งพรูออกมา"
    mary0 "ฉันจะอยู่กับเธอจนกว่าฝนจะหยุดตกเองจ้ะ"
    yume "ขอบคุณนะ"
    mary0 "ไม่เป็นไรจ้ะ"
    "สัมผัสอันอ่อนโยนวางประทับเหนือศีรษะของเรา"
    "อ้อมกอดของเธอทำให้เรารู้สึกไม่ได้อยู่ตัวคนเดียวอีกต่อไป"

    scene library_s_1080 with dissolve
    stop music
    play music 泣カナイデ

    yume "...อึก"
    "ทั้งๆที่เราไม่ควรจะมีร่างกาย แต่ความเปียกชื้นที่เกิดขึ้นนี่มันอะไรกันนะ?"
    "น้ำตาเหรอ?"
    "...ทำไมกัน?"
    "...ทั้งๆที่คนคนนั้นอ่อนโยนกับเราขนาดนั้น ทำไมเราถึงลืมเธอลง?"
    "...ทำไม?"

    show cat normal with dissolve

    cat normal "ไปต่อกันเถอะจ้ะ"
    yume "...เจ้าแมว..."
    cat normal "มาถึงตรงนี้ พวกเราถอยไม่ได้แล้วล่ะจ้ะ"
    yume "....."
    "เจ้าแมวพูดถูก"
    "ถึงความรู้สึกอึดอัดจะก่อตัวขึ้น ถึงความหมองหม่นจะไม่หายไป แต่ถ้ายังไม่ไปถึงปลายทาง เราก็ไม่รู้ว่าบทสรุปที่แท้จริงคืออะไรกัน"
    "...สู่ประตูต่อไป..."

    hide cat
    jump main_map

    
 
    