label memary_scene:
    scene memary with Dissolve(5.0)
    scene black with Dissolve(5.0)

    jump after_room_0_1
    return 

label intro:
    #Just Test
    jump final

    scene rouka_s_1080
    play music 廃墟洋館
    "... เส้นทางที่ไม่รู้จุดหมายทอดยาวต่อหน้าเรา..."
    "ที่นี่คือที่ไหนกัน?"
    "ตัวเราคือใครกัน?"
    "....."
    "ความมืดมิดโอบล้อมรอบร่างกายจนกระทั่งเราลืมตาตื่นขึ้น"
    "ทัศนะการมองเห็นค่อยๆกลับมาแจ่มชัด"
    "ร่างกายที่รู้สึกหนักหน่วงค่อยๆเบาบางลง"
    "สิ่งแรกที่เราทำหลังจากหยั่งยืนบนพื้นทางเดินอันมืดมนคือจ้องมองแขนขาและเรือนร่างของตัวเอง"
    yume "นี่มัน...."
    "น้ำเสียงของเราแหบพร่าอย่างผิดปกติ"
    "แต่สิ่งที่น่าประหลาดยิ่งกว่านั้นคือร่างกายของเรากลับมีเพียงความว่างเปล่า"

    yume "...ทำ...ไม...?"
    "คำพูดของเราขาดห้วง"
    "ทั้งๆที่เราประสาทสัมผัสบอกเราว่าร่างกายของเรามีอยู่จริง ทั้งแขนทั้งขากำลังขยับตามคำสั่งของเราทุกประการ แต่เมื่อจ้องมองไปยังส่วนที่ควรจะเป็นเรือนร่าง เรากลับพบเพียงอากาศธาตุเท่านั้น"
    "ร่างกาย...ของเรา...?"
    "...นี่เรากำลังล่องหนอยู่เหรอ?"
    "...หรือว่าเราไม่มีร่างกายตั้งแต่แรก?"
    "เราพยายามนึกถึงเหตุผลที่ทำไมเรามาอยู่ตรงนี้ แต่ไม่ว่าพยายามนึกถึงเท่าไหร่ก็นึกไม่ออก"

    "ที่นี่คือสถานที่ที่เราไม่รู้จัก"
    "มันทั้งมืดมิด ทั้งหนาวเหน็บและวังเวงไร้ผู้คน"

    yume "....."
    "ต้นกำเนิดแสงหนึ่งเดียวมีเพียงแสงสว่างที่ทอดผ่านหน้าต่างบานใหญ่ลงมา"
    scene moonlight3 with dissolve
    "ดวงจันทร์สีเงินขนาดใหญ่สาดทอแสง ราวกับมันกำลังจ้องมองเราจากเบื้องบนไม่มีผิด"

    "....."
    "เราก้มมองร่างกายของตัวเองที่เหลือเพียงความว่างเปล่าพร้อมกับตั้งคำถาม"
    "ไม่ใช่เพียงร่างกายที่หายไป แต่ความทรงจำข้างในก็กลวงเปล่าเช่นกัน"
    "...นี่เรา...เป็นใครกัน?"
    "....."
    scene rouka_s_1080 with dissolve
    cat0 "ไม่มีใครมาที่นี่นานแล้ว"
    yume "นั่นเสียงใคร?"
    cat0  "ก้มลงมองข้างล่างสิ"
    
    stop music
    play music 不穏
    
    show cat normal with dissolve
    "เราเผลอมองตามคำพูดลึกลับด้วยความอยากรู้อยากเห็น"
    "เจ้าของเสียงเล็กแหลมที่ดังขึ้นข้างกายเรามีขนาดเล็กจ้อยพอๆกับสองฝ่ามือคนเท่านั้น"

    yume "...แมว?"
    "เราอุทานขึ้นด้วยความตกใจเพราะไม่เคยเห็นสัตว์พูดได้มาก่อน"
    "เจ้าแมวลายส้มหรี่ตามองเราราวกับไม่สบอารมณ์น้อยๆ"

    cat fun "ไม่ใช่แมว แต่เป็นผู้นำทางต่างหาก"  with dissolve
    yume "ผู้นำทาง?"
    "แมวลายส้มตากลมโตจ้องมองเราด้วยความประหลาดใจ"
    "ทั้งๆที่แมวไม่ควรจะแสดงสีหน้าได้ชัดเจน แต่แมวตัวนี้กลับแสดงอารมณ์ได้ราวกับเป็นคน"


    cat ah "ดูเหมือนว่าเธอจะไม่รู้อะไรเลยสินะ" with dissolve 
    yume "ฉัน?"
    "เราพูดขึ้นด้วยความสงสัย"
    "เมื่อถูกถามคำถามนั้น เราก็พยายามนึกถึงเรื่องของตัวเองเพื่อให้ตอบคำถามได้"

    yume "...อึก!!"
    "ทันใดที่เราพยายามนึกถึงบางสิ่ง ความเจ็บปวดทรมานก็แล่นไปทั่ว"
    "ร่างกายที่ไม่มีอยู่จริงกำลังต่อต้านเจตจำนงของตัวเอง"
    "...นี่มัน...อะไรกัน...?"

    cat bored "เธออย่าฝืนจะดีกว่า" with dissolve
    yume "ฝืน?"
    cat normal "ตอนนี้เธอไม่สามารถนึกได้หรอกว่าตัวเธอเป็นใคร"
    yume "....."

    cat itasura "ถ้าเธออยากได้คำตอบว่าเธอเป็นใคร ทำไมเธอถึงอยู่ที่นี่ เธอมีทางเลือกเดียวเท่านั้น" with dissolve
    yume "ทางเลือก?"
    cat  normal "ตามฉันมา" with dissolve
    hide cat
    jump room0

label room0:
    yume "ประตู?"
    show cat normal with dissolve
    cat ah "เปิดเข้าไปสิ"
    "เรามองแมวสีส้มด้วยความไม่ไว้ใจ"
    "ดูเหมือนเจ้าแมวส้มจะอ่านความคิดเราออกมา มันเลยพูดขึ้น"
    cat normal "ฉันเข้าใจว่ามันไม่น่าไว้ใจ แต่ถ้าเธอไม่ทำตามคำพูดฉัน เธอก็ไม่มีทางเลือกอื่นนอกจากกลับไปหลงที่ทางเดินอย่างไร้จุดหมาย" with dissolve
    yume "....."

    cat lick "เธอจำอะไรไม่ได้สักอย่างเลยสินะ" with dissolve
    yume "...อืม"

    cat normal "ไม่แปลกหรอก ถ้าหากเธอรู้ว่าตัวเองเป็นใคร เธอจะไม่มีวันเดินหลงในสถานที่แห่งนี้เป็นอันขาด" with dissolve
    yume "ที่นี่คือที่ไหน?"
    cat pero "...."

    yume "แล้วฉันล่ะ...เป็นใคร...?"

    "เจ้าแมวส้มจ้องหน้าเรา ดวงตาของมันมองเข้ามาในตาของเราราวกับมองทะลุไปถึงตัวตนข้างใน"
    cat bored "ถ้าเธออยากรู้คำตอบ เธอก็ต้องเปิดประตู"
    yume "...."

    cat normal "เธอไม่มีทางเลือกหรอก เจ้าแมวส้มยืนยันเสียงแข็ง ดูเหมือนว่าเราจะไม่มีเส้นทางอื่นให้ไปนอกจากนี้ สุดท้าย เราก็เปิดประตูและเดินเข้าไปในห้อง"
    
    scene library_s_1080 with dissolve
    
    stop music
    play music 神隠しの真相
    yume "...นี่มัน...?"
    cat lick "ปริศนาไงล่ะ"
    yume "ปริศนา?"
    hide cat
    show puzzle0 with dissolve
    "เราจ้องมองโจทย์ที่ถูกเขียนบนกระดานและพูดทวนคำเจ้าแมวส้มด้วยความไม่เข้าใจ"
    "เมื่อเจ้าแมวเห็นเราสงสัย มันจึงพูดขยายความขึ้น"
    cat normal "นี่ไม่ใช่ห้องๆเดียว เส้นทางต่อจากนี้ยังมีอีกหลายห้อง"
    cat normal "ทางเดียวที่เธอจะไปถึงความจริงได้คือเธอต้องตอบปริศนาที่อยู่ในแต่ละห้องให้ถูกต้อง"
    cat normal "เมื่อตอบปริศนาประจำห้องถูกต้อง ประตูห้องต่อไปจะเปิดออก"
    cat normal "เมื่อถึงประตูบานสุดท้าย เธอจะเข้าใจความจริงทุกอย่างเอง"

    "เจ้าแมวส้มอธิบายสิ่งที่เราต้องเจอต่อจากนี้ไป"
    "สถานที่ที่แปลกประหลาดนี้มีบททดสอบที่ถูกสร้างขึ้นอย่างจงใจด้วยสาเหตุบางอย่าง"
    "ทำไมต้องเป็นปริศนา?"
    "ทำไมกัน?"
    cat normal "ปริศนาข้อแรกคือข้อที่ง่ายที่สุด ถ้าหากทำข้อนี้ไม่ได้ก็ไม่มีวันไปถึงข้อต่อไปได้"
    "เราพูดไม่ออก"
    "สายตาของเจ้าแมวส้มคล้ายกับกำลังหยั่งเชิงเราไม่มีผิด"

    yume "...ก็ได้"
    "ในเมื่อเราไม่มีทางอื่นให้มุ่งหน้าไป ก็มีแต่ต้องตอบปริศนาให้ได้"
    "ลองสักตั้งก็คงไม่เสียหาย"

    jump answer_roome0



label answer_roome0:
    menu:
        "answer":
            "try"
            $ input_value = renpy.input("Answer?")
            if prepare(input_value) == "memary":
                scene white with dissolve
                "ทันใดที่เราเขียนคำตอบที่ถูกต้อง โลกรอบข้างก็ถูกสีขาวกลืนเข้าไป"
                "แสงสว่าง?"
                "มันเกิดอะไรขึ้นกันแน่?"
                hide puzzle0
                stop music
                jump after_room_0
            else :
                "it's not answer"
                jump answer_roome0
    

label after_room_0:
    play music up_to_you
    scene flashback
    mary0 "ถ้าเราจะตั้งชื่อเกมทายปริศนา เราจะตั้งชื่อว่าอะไรดี?"
    yume "ฉันสงสัยมากกว่าว่าทำไมเธอถึงชอบเกมปริศนาขนาดนั้น"
    mary0 "ไม่มีเหตุผลเป็นพิเศษหรอกจ้ะ"
    yume  "เธอนี่แปลกคนจริงๆ"
    mary0 "เธอก็แปลกเหมือนกันจ้ะ ทั้งๆที่ไม่ชอบปริศนาแต่ก็ยังตอบคำถามฉันทุกครั้ง"
    yume "ถ้าทิ้งให้เธอคิดคำถามคนเดียวแล้วฉันไม่ตอบ ฉันจะรู้สึกผิดน่ะสิ"
    mary0 "ใจดีจริงๆเลยนะ ฮะๆๆ"
    yume "อึก...ไม่ได้มากมายอะไรขนาดนั้นหรอก..."
    mary0 "กลับมาที่สาระเดิมดีกว่าจ้ะ"
    yume "ที่เราคุยกันนี่มีสาระจริงๆเหรอ?"
    mary0 "โหดร้ายจริงๆนะ เธอไม่คิดว่าเรื่องไร้สาระก็มีความสนุกในรูปแบบของมันเหรอ?"
    yume "ก็ได้ๆ...ให้คิดชื่อเกมปริศนาให้เธอใช่ไหม?"
    mary0 "ใช่จ้ะ"
    yume "อืมม..."
    mary0 "ว่าไงจ้ะ?"
    yume "งั้นเอาเป็นชื่อ..."

    scene black with dissolve
    
    "ภาพตรงหน้าจมลงสู่ความมืดในทันที"
    "เงาร่างอันลางเรือนที่ปรากฏตรงหน้าเราหายไปแล้ว"
    "เหลือทิ้งไว้เพียงคำบางอย่างที่ตกค้างในความทรงจำ"

    jump memary_scene


label after_room_0_1:
    stop music 
    play music 泣カナイデ

    scene library_s_1080 with dissolve
    
    show cat normal
    yume  "...อึก"
    "เราลืมตาตื่นขึ้นและพบตัวเองในห้องเดิม"
    yume  "เมื่อกี้นี้...เกิดอะไรขึ้น...?"
    cat normal "มันคือเศษเสี้ยวของความทรงจำ"
    yume  "ความทรงจำ?"
    cat  smile "ทุกครั้งที่เธอตอบคำถามได้ เธอจะได้ความทรงจำของเธอกลับมาส่วนหนึ่ง"
    yume  "....."
    cat normal "เธออาจไม่เข้าใจว่าทำไมสถานที่แห่งนี้ถึงทำงานแบบนี้ แต่เมื่อเธอได้ความทรงจำกลับมาทั้งหมด เธอจะรู้ตัวตนที่แท้จริงของตัวเองและเหตุผลที่เธอมาที่นี่เอง"
    "เจ้าแมวส้มจับจ้องเข้ามาในดวงตาเราตรงๆ"
    "สายตาเจนจัดของมันทำให้เรารู้สึกเหมือนจ้องหน้ามนุษย์ไม่มีผิด"
    yume  "ถ้างั้นก็มีแต่ต้องตอบคำถามไปเรื่อยๆสินะ"
    cat smile "ใช่แล้ว"
    "เจ้าแมวส้มตอบรับเราพลางพยักหน้า เราที่ไม่มีทางเลือกอื่นจึงทำได้แต่เดิมตามเกมของมัน"
    "เมื่อเราจะเดินเข้าสู่ประตูบานต่อไป เรากลับพบกับวัตถุบางอย่างบนพื้นก่อน"
    cat  lick "เก็บมันไปสิ"
    yume  "จดหมาย?"
    cat ah "มันคือรางวัลของผู้ชนะห้องแรก พกไปเถอะ มันไม่มีอันตรายอะไรหรอก"
    "เจ้าแมวส้มยืนยัน เราจึงถือจดหมายไว้"
    "ไม่นานหลังจากนั้น เราก็พบตัวเองอยู่ตรงหน้าประตูบานต่อไป"
    cat  bored "....."
    "ถึงแม้จะยังไม่เข้าใจอะไร แต่เมื่อเราได้เห็นภาพอันลางเรือนหลังตอบคำถามแล้ว ความรู้สึกถวิลหาก็ปรากฏขึ้นในใจของเรา"
    "คนที่คุยกับเราในภาพความทรงจำนั้นคือใคร?"
    "...ความรู้สึกอันรุนแรงเพรียกร้องให้เราเดินต่อไปข้างหน้า..."
    "รู้ตัวอีกที เราก็เปิดประตูบานต่อไปแล้ว"

    jump main_map