label true_end:
    scene black with dissolve
    stop music
    play music 憂鬱

    "ความทรงจำในอดีตหวนกลับมาอีกครั้ง"
    "...เราจำได้แล้ว...ว่าทำไมพวกเราทั้งสองจึงมาอยู่ที่คฤหาสน์แห่งนี้..."
    "ที่นี่ไม่ใช่โลกความเป็นจริง มันคือโลกหลังความตาย"
    "....."

    scene black with dissolve

    "หลังจากเราฆ่าคน แม้เราไม่มีเจตนา แต่เราไม่สามารถหลบหนีการลงโทษได้"
    "เราถูกตัดสินจำคุกข้อหาฆ่าพ่อของแมรี่"
    "ก่อนที่เราสองคนจะจากกัน พวกเราสองคนได้ให้สัญญากัน"
    "...เมื่อเราออกจากเรือนจำและเป็นอิสระ พวกเราสองคนจะกลับมาอยู่ด้วยกันอีกครั้งหนึ่ง"
    "....."

    scene sky_cloudy with dissolve
    "เวลาผ่านไปหลายปี เราพ้นโทษและออกมาจากเรือนจำ"
    "แต่เมื่อเรากลับมาหาแมรี่ ทุกอย่างก็สายไปแล้ว"
    "....."

    scene hospital with dissolve
    "เราพบร่างไร้สติของแมรี่บนเตียงในโรงพยาบาล"
    "ไม่ว่าเราจะเรียกเธอสักกี่ครั้ง แมรี่ก็ไม่ลืมตาตื่นขึ้น"

    yume "ว่าไงนะคะ?"

    "เราไม่อยากเชื่อหูของเราเมื่อได้ยินความจริงจากแพทย์ที่ดูแลแมรี่"
    "แมรี่ร่างกายอ่อนแอตั้งแต่เด็กๆแล้ว แต่เธอปิดความลับนี้ไว้และแสร้งทำเป็นแข็งแรงดีต่อหน้าเรา"
    "อวัยวะภายในของเธอล้มเหลวมากขึ้นตามเวลาที่ผ่านไป"
    "...จนสุดท้ายแมรี่ก็กลายเป็นเจ้าหญิงนิทรา..."
    "เธอจะมีชีวิตได้อีกไม่กี่วันเท่านั้น"
    "....."

    scene black with dissolve

    "ความสิ้นหวังทำให้เราหัวเราะและร้องไห้ออกมาพร้อมๆกัน"
    "...เอาอีกแล้ว..."
    "ทั้งเรื่องที่ถูกคนรอบข้างรังแกและตีตัวออกห่างเพราะแม่เป็นฆาตกร"
    "ทั้งพ่อที่นิสัยเลวร้ายลงหลังจากบ้านเราแตกสาแหรกขาด"
    "ทั้งเรื่องที่เราฆ่าพ่อของแมรี่โดยไม่ได้ตั้งใจจนถูกจับเข้าเรือนจำ"
    "ทุกสิ่งไม่เป็นตามที่เราต้องการ...แต่เราก็ยังอดทนได้..."
    "....."
    "แต่ว่า...แมรี่..."
    "ผู้หญิงที่เรารักที่สุด...ความสุขในชีวิตเราที่ยังหลงเหลืออยู่..."
    "...พังทลาย..."
    "...ชีวิตของเธอกำลังพังทลายลง..."
    "...ต่อหน้าเรา..."
    "...โดยที่เรา..."
    "...เรา..."
    "....."
    "...เราไม่สามารถทำอะไรได้แม้แต่อย่างเดียว..."
    "....."
    "ยูเมะ" 
    "เธอจะมีตัวตนอยู่บนโลกนี้ทำไมกัน?"
    "ในเมื่อเธอไม่สามารถรักษาสิ่งสำคัญของตัวเองเอาไว้ได้"
    "...แม้แต่อย่างเดียว..."

    ################################
    scene road with dissolve

    "ความเจ็บปวดแสนสาหัสก่อตัวขึ้นในอกทั้งๆที่ไม่มีบาดแผล"
    "หัวใจของเราเจ็บปวดเหมือนถูกมีดนับสิบรุมฉีกกระชาก"
    "ทั้งที่ยังมีลมหายใจแต่เรารู้สึกเหมือนวิญญาณแหลกสลาย"
    "...ภาพตรงหน้ามืดมัว..."
    "ความหวังคืออะไรกัน?"
    "...โลกนี้...มันคงไม่มีความหวังสินะ..."
    "....."
    "รู้ตัวอีกที เราก็กำลังย่างเท้าลงบนถนน"
    "สัญญาณไฟยังเป็นสีเขียว รถยังคงวิ่งบนถนนเต็มไปหมด"
    "....."
    "...นั่นสินะ..."
    "ถ้าหากต้องเหลืออยู่ตัวคนเดียวแล้วล่ะก็...ขอหายไปซะยังจะดีกว่า..."
    "...ก็เราน่ะ...สัญญากับเธอไว้แล้วนี่นา..."
    "พวกเราสองคนจะกลับมาพบกันอีกครั้งหนึ่ง"

    yume "ฉันจะตามเธอไปแล้วนะ แมรี่"
    "คำพูดสั่งลาของเราที่ไม่มีใครนอกจากเราได้ยิน"
    "เราเดินลงบนถนน ไม่ช้าหลังจากนั้น เสียงบีบแตรของรถก็ดังขึ้น"
    "รถคันหนึ่งประชิดร่างของเราพร้อมกับที่แรงกระแทกมหาศาลถูกส่งผ่านเข้ามาในร่างกาย"
    
    scene black with Dissolve(0.2)

    "ภาพตรงหน้าเรามืดลงในพริบตาเดียว"
    "....."
    "สิ่งที่ไม่มีตัวตนอยู่ย่อมไม่มีทางสัมผัสถึงความเจ็บปวดและความโศกเศร้า"
    "เท่านี้ ยูเมะจะได้หายไปสักที"
  
    stop music
    play music reflect

    scene fb3_3 with Dissolve(1)

    "เราล้มลงทั้งยืนต่อหน้าแมรี่"
    yume "อั่ก...อ๊า-------!!!!!"
    "ความเจ็บปวดทรมานแทรกผ่านเข้ามาในศีรษะของเราอย่างแสนสาหัส"
    "ความจริงที่หวนคืนกลับมาทำให้เรารู้สึกทุกข์ทรมานเหลือเกิน"
    mary "เธอได้อ่านจดหมายที่ฉันส่งให้แล้วสินะ"
    yume "จดหมาย?"
    "แมรี่หมายถึงจดหมายที่เราเจอในห้องแรกๆ"
    "เราอ่านข้อความในจดหมายนั้นและโยงเข้ากับเฉลยในปริศนาสุดท้าย"
    "คำตอบที่แท้จริงคือ จงมีชีวิตอยู่"
    "....."
    mary "ยูเมะ อย่าโกหกตัวเองอีกเลย"
    yume "แต่...แต่ว่า!?"
    mary "เธอน่ะไม่ได้ลืมตัวตนของตัวเองหรอก เธอแค่ทำเป็นมองไม่เห็น ทำเป็นลืมทุกอย่างเท่านั้น"
    yume "...!!"
    mary "จริงอยู่ว่าที่นี่คือขอบเขตระหว่างคนเป็นกับคนตาย แต่มันไม่ได้ทำให้รูปลักษณ์ของเธอกลับสู่ความว่างเปล่าหรอก"
    yume "หมายความว่า..."
    mary "เธอคือคนที่ปฏิเสธตัวตนที่เจ็บปวดของตัวเองและฉันคือคนที่พยายามพาเธอกลับมา"
    yume "...อึก"
    "เด็กสาวผมทองจับจ้องเราด้วยดวงตาขึงขัง"
    "แมรี่ที่เคยเต็มไปด้วยรอยยิ้มกลับแข็งกร้าวขึ้นราวกับเป็นคนละคน"
    "ทั้งหมดก็เพื่อสิ่งที่เธอยืนหยัด"
    "...เพื่อเอาเรากลับคืนมา..."


    yume "ฮะๆๆ ฮ่าๆๆๆๆๆ"
    mary "......."
    "เราหัวเราะออกมา"
    "มันไม่ใช่เสียงหัวเราะแห่งความยินดี แต่เป็นเสียงหัวเราะที่มีไว้เพื่อประชดประชันตัวเอง"
    "เสียงหัวเราะของเราทำให้แมรี่หน้าหมองลงอย่างเห็นได้ชัด"
    yume "ต่อให้กลับมาจำทุกอย่างได้แล้วมันจะยังไงล่ะ แมรี่"
    mary "....."
    yume "โลกข้างนอกนั่น มันไม่มีความสุขรออยู่"
    mary "...ยูเมะ..."
    yume "เพราะฉันเป็นฉันใช่ไหม? ฉันเลยต้องเจอกับโชคร้ายทั้งหมดนั่น...มันไม่ยุติธรรมเลย..."
    mary "....."
    yume "ถ้าหากฉันไม่สามารถมีความสุขเมื่อมีชีวิตได้ ฉันก็ไม่ขอมีชีวิตอยู่"
    mary "...นั่นมัน..."
    yume "เพื่อรักษาสัญญาที่มีต่อเธอ ต่อให้ต้องเสียอะไรไป ฉันก็จะทำ"


    "...ใช่แล้ว..."
    "เราไม่ได้เดินลงบนถนนโดยไม่เข้าใจว่าตัวเองกำลังทำอะไรหรอก"
    "เราเดินลงไปโดยรู้ดีว่าเราต้องตาย"
    "...ทั้งหมดเพียงเพื่อรักษาสิ่งสุดท้ายที่เรายังเหลืออยู่...สัญญาที่มีต่อคนที่เรารักที่สุด..."
    "พวกเราสองคนจะกลับมาพบกันอีกครั้งหนึ่ง"
    "...แม้แต่ความตายก็ไม่อาจพรากจากกัน..."
    yume "ฉันไม่สนใจหรอกว่าจะมีคนบอกว่าฉันเป็นคนอ่อนแอหรือเป็นคนบ้า"
    mary "ยูเมะ"
    yume "ฉันน่ะ...ก็แค่อยากอยู่กับเธอ..."
    mary "....."
    yume "ได้โปรด อย่าทิ้งฉันไป...แมรี่..."
    "น้ำตาสองสายหลั่งรินออกมา"
    "กระแสแห่งความรู้สึกอาบท่วมใบหน้าของเราเต็มไปหมด"

    stop music
    play music 泣カナイデ

    "สัมผัสอบอุ่นโอบรอบร่างที่ทรุดลงกับพื้นของเรา"
    yume "แมรี่"
    "เราพูดชื่อของเจ้าของอ้อมกอดที่โอบอุ้มร่างเรา"
    "เด็กสาวผมทองหลั่งน้ำตาให้เราพร้อมกับส่งยิ้มที่แสนเศร้าให้"
    mary "ฉันน่ะ...คงเป็นคนเห็นแก่ตัวมากสินะ..."
    yume "หา?"
    mary "ทั้งเข้าใกล้เธอและพยายามตีสนิทกับเธอเพราะคิดว่าเธอมีอะไรคล้ายๆกับฉัน ทั้งจงใจทายปริศนาไร้สาระทั้งๆที่รู้ว่าเธอไม่ชอบตอบคำถามฉัน"
    yume "...ไม่...ไม่ใช่..."
    mary "ฉันสนิทกับเธอมากขึ้นแล้วก็เข้าใจ จริงๆแล้วฉันอยากผูกพันกับเธอตั้งแต่แรกอยู่แล้ว"
    yume "...ทำไม?"
    mary "นั่นสินะ อาจเพราะว่าเธอเข้มแข็งกว่าฉันก็ได้"
    yume "เข้มแข็ง?"
    "คำว่า ‘เข้มแข็ง’ เป็นสิ่งที่ไม่เข้ากับตัวเราเลย"
    "คนที่พยายามหลบหนีจากตัวตนของตัวเอง ไม่ว่าจะดูยังไงก็เป็นคนขี้ขลาด"


    mary "ทั้งๆที่เธอมีชีวิตที่โหดร้ายพอกับฉัน แต่เธอเลือกที่จะยืนหยัดกับมัน" 
    yume "....."
    mary "ตอนที่ฉันเห็นเธอยืนขัดโต๊ะคนเดียว โดนคนอื่นรังแกแต่ไม่เคยร้องไห้ ฉันก็คิดมาตลอดว่า ‘เธอคนนี้แหละคือคนที่ฉันอยากเป็น’"
    "คำพูดของแมรี่ทำให้เรารู้สึกเจ็บแปลบในอก"
    "เธอมองเราเป็นคนเข้มแข็งแบบนั้นมาตลอดเลยงั้นเหรอ"
    mary "ฉันน่ะเกิดมาร่างกายก็อ่อนแอ พ่อก็ไม่ชอบฉัน แม่ก็ทิ้งฉันไป...เพราะอย่างนั้น ฉันถึงร้องไห้ทุกวัน...ในห้องส่วนตัวที่ไม่มีใครอยู่..."
    yume "....."
    "แมรี่ที่ยิ้มแย้มให้เราร้องไห้ทุกคืน"
    "ความจริงที่เราเพิ่งรับรู้ทำให้เรารู้อับอายที่เราไม่เคยเข้าใจเธอ"
    "เราก้มหน้าลงเพื่อหลบสายตาของเธอ แต่แมรี่ช้อนคางของเราขึ้น ให้เราสบตากับเธอตรงๆ"
    mary "แต่หลังจากเจอเธอ ฉันก็ร้องไห้น้อยลง"
    mary "ชีวิตที่มีเธออยู่มันสวยงามมากเลยนะ ยูเมะ...เพราะแบบนั้นฉันเลยแสร้งทำเป็นเข้มแข็งเพื่อให้สามารถยืนร่วมกับเธอได้..."
    mary "เพราะอย่างนั้น ฉันเลยไม่ได้บอกความจริงเรื่องร่างกายอ่อนแอให้เธอฟัง เพราะฉันกลัวว่าฉันจะกลายเป็นตัวถ่วงรั้งความเข้มแข็งของเธอ"

    mary "...ฉันนี่มันเห็นแก่ตัว...ว่าไหม?"
    "เสียงหัวเราะเศร้าๆดังมาจากเด็กสาวผมทอง"
    "น้ำตาสองสายของแมรี่หลั่งรินออกมามากขึ้น"
    yume "...ไม่หรอก..."
    "เราส่ายหน้าเบาๆ"
    "เราไม่ได้เข้มแข็งขนาดนั้นและแมรี่ก็ไม่ใช่คนเห็นแก่ตัว"
    yume "ฉันก็อยากอยู่กับเธอเหมือนกัน"
    mary "...ยูเมะ..."
    yume "ฉันไม่ได้เข้มแข็งอะไรหรอก ฉันแค่ทำเป็นไม่รู้สึกอะไร"
    yume "มันง่ายกว่าที่จะปฏิเสธตัวเองและมีชีวิตอยู่ไปวันๆโดยไม่ตั้งคำถาม"
    "ก่อนหน้าที่เราจะเจอแมรี่ เราทิ้งความหวังทั้งหมด เราเลือกที่จะไม่สนใจอะไรทั้งนั้น"
    "เราค่อยๆได้ความเป็นมนุษย์กลับมาเมื่อพบกับแมรี่"
    "ชีวิตของเรามีความหมายขึ้นเมื่อเราได้อยู่กับเธอ"
    yume "ฉันต่างหากที่ต้องขอบคุณเธอ ฉันไม่รู้จะชดใช้อะไรให้เธอดี"
    yume "แต่เมื่อฉันกลับมาพบกับเธอ ฉันก็ไม่มีโอกาสจะทำอะไรเพื่อเธอแล้ว"
    mary "เธอก็เลย..."
    yume "ฉันเลยเลือกที่จะทิ้งทุกอย่างอีกครั้ง"
    "เราพูดความจริง"
    "เรายอมพูดมันออกมาในที่สุด"
    "ความอ่อนแอของเรา ความเปราะบางของเรา"
    "...เราไม่สามารถปฏิเสธมันได้อีกต่อไป..."
    yume "ขอโทษนะ"
    mary "....."
    yume "ขอโทษที่เป็นคนอ่อนแอ ขอโทษที่เป็นคนขี้ขลาด"
    mary "....."
    yume "ขอโทษที่ทำให้เธอมีความสุขไม่ได้เลย"
    "คำพูดของเราถูกหยุดลงเพราะอ้อมกอดของแมรี่แน่นหนาขึ้น"
    "สองแขนบางที่โอบร่างเราไว้สั่นเทาไปหมด"
    mary "นั่นมันไม่จริงสักหน่อย"
    yume "....."
    mary "ช่วงเวลาที่ฉันอยู่กับเธอ ฉันมีความสุขที่สุดเลยนะ"
    yume "แมรี่"
    mary "เพราะฉะนั้น ฉันจะไม่ยอมให้ชีวิตของเธอจบลงแค่นี้"


    "ดวงตาของแมรี่แน่วแน่"
    "แม้น้ำตาจะยังอาบท่วมนวลแก้มขาว แต่ความปรารถนาอันแรงกล้าของเธอไม่มีวันสั่นคลอน"
    mary "ชีวิตมันอาจจะไม่ยุติธรรมและโหดร้าย แต่นั่นไม่ใช่ทั้งหมดหรอกนะ"
    mary "เพราะเธอมีชีวิตอยู่ พวกเราเลยมีโอกาสได้เจอกัน...จริงไหมล่ะ?"
    "คำพูดของแมรี่หลั่งไหลเข้ามาในใจเรา เราไม่สามารถปฏิเสธเธอได้"
    "เราคือคนขี้ขลาด เธอต่างหากที่เป็นคนเข้มแข็ง"
    "ไม่งั้นเธอคงไม่ทุ่มเทพาเราเดินมาถึงห้องสุดท้ายเพื่อพาเรากลับมาหรอก"
    mary "ถ้าตายไปแล้ว มันไม่มีความทุกข์ก็จริงแต่ความสุขทั้งหมดก็จะหายไปเหมือนกัน"
    mary "ตราบใดที่ยังมีชีวิต เธอก็ยังมีโอกาส ตราบใดที่ยังมีโอกาส เธอก็ยังสามารถมีความสุขได้"
    yume "...ความสุข...ในโลกที่ไม่มีเธองั้นเหรอ...?"
    "เราพูดแทรกขึ้นด้วยเสียงสะอื้นไห้"
    "เด็กสาวผมทองพยักหน้าให้เราพร้อมกับยื่นมือข้างหนึ่งมาสัมผัสแก้มขวาเราไว้"
    mary "ฉันไม่ใช่ตัวแทนความสุขของเธอ"
    mary "โลกนี้ยังมีอีกหลายสิ่งที่ทำให้เธอมีความสุขได้"
    mary "เพราะฉะนั้น จงมีชีวิตอยู่ต่อไปซะ ยูเมะ"
    mary "จงมีชีวิตและมีความสุข"
    mary "และหลังจากใช้ชีวิตเต็มที่แล้วค่อยรักษาสัญญาที่มีต่อฉันก็ยังไม่สาย"
    mary "...เข้าใจนะ"
    yume "...พวกเราจะกลับมาพบกันอีกครั้ง..."
    mary "ใช่แล้วจ้ะ"
    "แมรี่ยิ้มกว้างขึ้นทั้งน้ำตา"
    "นี่สินะ คือความปรารถนาที่แท้จริงของเธอ"
    "...เธออยากให้เรามีชีวิตอยู่..."
    "...เธออยากให้เราพบกับความสุขโดยที่เป็นอิสระจากตัวเธอ..."

    yume "แมรี่"
    mary "จ้ะ?"
    yume "เธอนี่มัน...เห็นแก่ตัวจริงๆ..."
    "คำพูดของเราสิ้นสุดลง สัมผัสอบอุ่นก็ประทับลงบนริมฝีปากของเรา"
    "จุมพิตที่หอมหวานและเต็มไปด้วยความเจ็บปวดเชื่อมต่อพวกเราสองคนเอาไว้"
    "ก่อนที่ใบหน้าของพวกเราทั้งสองจะเลื่อนห่างออกจากกัน"
    mary "ขอโทษและขอบคุณสำหรับทุกสิ่งทุกอย่างนะจ้ะ"
    yume "...แมรี่..."
    mary "ลาก่อน ผู้หญิงที่ฉันรักที่สุดในโลก"
    scene white with Dissolve(5)
    "โลกรอบข้างถูกแสงสีขาวกลืนกินเข้าไปทีละน้อยๆ"
    "แสงสว่างอันอบอุ่นค่อยๆปกคลุมทัศนียภาพตรงหน้า"
    "สิ่งสุดท้ายที่เราเห็นก่อนที่สีขาวบริสุทธิ์จะดูดกลืนเราเข้าไปคือรอยยิ้ม"
    "...รอยยิ้มของแมรี่..."
    yume "ลาก่อน แมรี่"

#####################################################################
    scene black with Dissolve(5)
    
    stop music
    play music アクアの旅路

    "คฤหาสน์แห่งนั้นคงเป็นโลกระหว่างความเป็นความตาย"
    "เราจงใจฆ่าตัวตายเพื่อจะตามแมรี่ไป แต่แมรี่ก็พยายามทุกวิถีทางเพื่อดึงตัวตนเรากลับมาและพาชีวิตที่ใกล้แหลกสลายของเรากลับมายังโลกของคนเป็น"
    "....."
    scene hospital with dissolve 
    "หลังจากลากับแมรี่ เราลืมตาตื่นขึ้นและพบตัวเองนอนอยู่ในโรงพยาบาล"
    "แพทย์ที่ดูแลเราบอกเราว่าเราพ้นภาวะวิกฤติอย่างฉิวเฉียด"
    "ปาฏิหาริย์ ทุกคนขนานนามการรอดชีวิตของเราแบบนั้น"
    "...มันก็คงไม่ผิดจริงๆ..."
    "แมรี่คือปาฏิหาริย์ของเราเสมอมา"
    "....."
    scene sky_morning with dissolve
    "ตั้งแต่แมรี่เสียชีวิต เวลาก็ผ่านมาหลายปีแล้ว"

    
    yume "ฉันมาเยี่ยมเธอนะ แมรี่"
    scene cg3 with Dissolve(1)

    "วันนี้คือวันครบรอบวันตายของเธอ" 
    "เรามาเยี่ยมเธอพร้อมกับดอกไม้ที่เธอชอบที่สุด"
    yume "ฉันจำได้ เธอชอบดอกพลับพลึงขาวใช่ไหมล่ะ?"
    "เราพูดพร้อมกับวางดอกไม้หน้าสุสานของผู้หญิงที่ตัวเองรัก แม้เราจะรู้แก่ใจว่าแมรี่ไม่อยู่กับเราแล้ว แต่เราก็ยังคุยกับป้ายสุสานเหมือนเธอยังมีชีวิตอยู่"
    "เราจ้องมองป้ายสุสานตรงหน้าด้วยรอยยิ้มเศร้าๆ"
    "อดีตที่แสนขมขื่นทำให้เราเจ็บปวดทุกครั้งที่นึกถึง แต่มันไม่มีทางทำให้เราอ่อนแอลงหรือพยายามปฏิเสธตัวเองอีกครั้ง"
    "...แมรี่คือคนที่ทำให้เราเข้าใจถึงคุณค่าของชีวิต..."
    "ไม่ว่าจะเป็นความทุกข์ ความสุข การสูญเสียหรือความเจ็บปวด"
    "ทุกสิ่งล้วนหล่อหลอมให้เรากลายเป็นเราจนถึงทุกวันนี้"
    "....."
    "จริงอยู่ที่อดีตทำให้เราเจ็บปวด แต่เราก็ขอมีชีวิตอยู่กับมันอย่างภาคภูมิ"
    "เราจะไม่ปฏิเสธตัวเองอีกต่อไป"
    "....."
    "เราคุกเข่าลงต่อหน้าสุสานของแมรี่"
    yume "คนเห็นแก่ตัว"
    yume "เพราะเธอแท้ๆเลย ฉันเลยต้องมีชีวิตอยู่ต่อไป"
    yume "ฮะๆๆ"
    "เราหัวเราะ"
    "มันไม่ใช่เสียงหัวเราะประชดประชัน แต่เป็นเสียงหัวเราะจากใจจริงของเรา"
    "แทนที่จะจมปลักกับความเศร้าจากการสูญเสียคนสำคัญ สู้จดจำช่วงเวลาอันสวยงามที่เราได้ใช้ชีวิตร่วมกับคนคนนั้นเสียยังจะดีกว่า"
    "....."
    scene sky_morning with dissolve
    "เราเงยหน้าขึ้นมองท้องฟ้า"
    "ท้องฟ้าปลอดโปร่ง"
    "...ช่างเป็นวันที่สวยงามจริงๆ..."
    "...เพราะเรายังมีชีวิตอยู่ เราเลยได้เห็นท้องฟ้านี้..."
    "...ตราบใดที่ยังมีลมหายใจ เราก็ยังมีโอกาสที่จะมีความสุข..."
    "....."
    "...ใช่ไหมล่ะ...แมรี่ของฉัน..."
    scene white with Dissolve(3)
    scene meandmary with dissolve(3)
    scene black with Dissolve(5)
    return